var app = angular.module('myApp',[
    'infinite-scroll',
    'mobile-angular-ui'
]);
var SERVER_ADDRESS = "";
var encrypt = new JSEncrypt();
var decrypt = new JSEncrypt();
function GetQueryString(name)
{
   /* var reg = new RegExp("(^|&)"+ name +"=([^&]*)(&|$)");
    var r = window.location.search.substr(1).match(reg);
    if(r!=null)return  unescape(r[2]); return null;*/
    var reg = new RegExp("(^|&)"+name+"=([^&]*)(&|$)");
    var result = window.location.search.substr(1).match(reg);
    return result?decodeURIComponent(result[2]):null;
}
/**
 * 封装的isEmpty
 *
 * **/

function isEmpty(obj) {
    if (obj == null || obj == undefined || obj == "" || obj == "undefined" || obj == "null") {
        return true;
    }
    return false;
}
/**
 * 判断手机号码是否正确
 *
 * **/
function checkIsMobile(mobile) {

    if (isEmpty(mobile) || !(/^1[3|4|5|8|7][0-9]\d{4,8}$/.test(mobile))) {
        return false;
    }
    return true;
}
/**-拦截器截取处理参数-**/
app.config(function($httpProvider){
    $httpProvider.defaults.headers.post['Content-Type'] = 'application/x-www-form-urlencoded;charset=utf-8';
    var param = function(obj) {
        var query = '', name, value, fullSubName, subName, subValue, innerObj, i;
        for(name in obj) {
            value = obj[name];

            if(value instanceof Array) {
                for(i=0; i<value.length; ++i) {
                    subValue = value[i];
                    fullSubName = name + '[' + i + ']';
                    innerObj = {};
                    innerObj[fullSubName] = subValue;
                    query += param(innerObj) + '&';
                }
            }
            else if(value instanceof Object) {
                for(subName in value) {
                    subValue = value[subName];
                    fullSubName = name + '[' + subName + ']';
                    innerObj = {};
                    innerObj[fullSubName] = subValue;
                    query += param(innerObj) + '&';
                }
            }
            else if(value !== undefined && value !== null)
                query += encodeURIComponent(name) + '=' + encodeURIComponent(value) + '&';
        }

        return query.length ? query.substr(0, query.length - 1) : query;
    };

    $httpProvider.defaults.transformRequest = [function(data) {
        return angular.isObject(data) && String(data) !== '[object File]' ? param(data) : data;
    }];
});
/**-拦截器处理session-**/
app.factory("httpInterceptor", ["$q", "$rootScope","$window", function ($q, $rootScope) {
    return {
        request: function (config) {
            config.headers = config.headers || {};
            if (sessionStorage && sessionStorage.getItem("session")) {
                config.headers.session = sessionStorage.getItem("session");
            }
            return config;
        }
    };
}]);
//拦截器
app.config(['$httpProvider', function ($httpProvider) {
    $httpProvider.defaults.headers.common= {'source':'webapp','version':"2.0"};
    $httpProvider.interceptors.push('httpInterceptor');
}]);

app.run(function($rootScope) {
    $rootScope.SERVER = SERVER_ADDRESS;
    $rootScope.URL_ROOTS = $rootScope.SERVER + "/2.0"; //hybrid开发的全局地址
    $rootScope.ROOT = $rootScope.SERVER + "/webapp/m/hybrid/hyhtml/";
    $rootScope.IS_LOGIN = false;
});
/**-首页-**/
app.controller('WkIndexController', ['$rootScope', '$scope', '$http',
    function($rootScope, $scope, $http) {
        //封装传递给安卓和IOS
        $scope.loadURL = function (url) {
            var iFrame;
            iFrame = document.createElement("iframe");
            iFrame.setAttribute("src", url);
            iFrame.setAttribute("style", "display:none;");
            iFrame.setAttribute("height", "0px");
            iFrame.setAttribute("width", "0px");
            iFrame.setAttribute("frameborder", "0");
            document.body.appendChild(iFrame);
            // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
            iFrame.parentNode.removeChild(iFrame);
            iFrame = null;
        };
    var bannerUrl=$rootScope.URL_ROOTS+ "/index/banner";//banner轮播图
        $http.get(bannerUrl).success(function (response) {
            if(response.status=="200"){
                $scope.banners=response.data;
            }
        });
    var moreUrl=$rootScope.URL_ROOTS+ "/index/hot_top";//推荐详情列表
        $http.get(moreUrl).success(function (response) {
            if(response.status=="200"){
                $scope.hotTitle=response.title;//热门推荐标题
                $scope.hotList=response.data;//热门推荐列表
            }
        });
        //邀请好友
        $scope.inviteFriends=function () {
            $scope.loadURL("BKDACTION://inviteFriendsClick?");
        }
        //房抵押
        $scope.houseClick=function () {
            $scope.loadURL("BKDACTION://houseLinkClick?");
        }
        //信用贷
        $scope.creditCk=function () {
            $scope.loadURL("BKDACTION://creditClick?");
        }
        //计算器
        $scope.calculator=function () {
            $scope.loadURL("BKDACTION://calculatorClick?");
        }
        //商城更多
        $scope.moresCk=function () {
            $scope.loadURL("BKDACTION://evenMoreClick?");
        }
        //经纪人收款
        $scope.proceeds=function () {
            $scope.loadURL("BKDACTION://proceedsClick?");
        }
        //列表
        $scope.moreLink=function () {
            $scope.loadURL("BKDACTION://mortPageClick?");
        }
        //热门推荐跳转
        $scope.hotPage=function ($hot) {
			var shareUrl=window.location.href;
            $scope.libiao={};
            $scope.libiao.details_id=$hot.id;
            $scope.libiao.p_name=$hot.p_name;
            $scope.libiao.pic=$hot.pic;
            $scope.contentPamar={"title":"抵押贷详情","content":$scope.libiao,"titleIcon":$scope.libiao.p_name+"房抵贷，在线申请免服务费","imgUrl":$scope.libiao.pic,"contentIcon":"拒绝猫腻，全程透明，更提供快速解压。点击查看额度","Url":shareUrl};
            $scope.listData=JSON.stringify($scope.contentPamar);
            $scope.loadURL("BKDACTION://lbClick?"+$scope.listData);
        }
		         $scope.dataList=[
            {
                "id":0,
                "p_name":"张**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"你们的班花为什么还单身？魔鬼经济学给出最新研究成果",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=0"
            },
            {
                "id":1,
                "p_name":"王**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"篡改驾驶培训学时:非法获利达1597万元,已被提起公诉",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=1"
            },
            {
                "id":2,
                "p_name":"赵**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"《歌手》里知名度不高的李晓东，人生经历过怎样的大起大落？",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=2"
            },
            {
                "id":3,
                "p_name":"李**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"虚报瞒报票房被罚 什么原因导致影院造假？",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=3"
            },{
                "id":4,
                "p_name":"马**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"为啥买房总被中介牵着鼻子走？这些套路真的防不胜防！",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=4"
            },
            {
                "id":5,
                "p_name":"杨**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"高收益理财险双十一风光不再 综合型消费险潜力更大",
                "url":"/webapp/m/hybrid/hyhtml/index/page.html?id=5"
            }
        ];
        $scope.dataOneList=[
            {
                "id":0,
                "p_name":"土豆",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"5G到底有多厉害？5G流量收费方式曝光！",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517986191.jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=0"
            },
            {
                "id":1,
                "p_name":"地瓜",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"大地震！谷歌突然宣布！华为懵了，百度、滴滴要哭了！",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517986244.jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=1"
            },
            {
                "id":2,
                "p_name":"花花",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"分答平台卷土重来：除了直播答题，还要签约百位行家打造大咖",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517986268.jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=2"
            },
            {
                "id":3,
                "p_name":"佳佳",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"快车、出租车、拼车、共享单车，美团摩拜嘀嗒易到全线围剿滴滴",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=3"
            },{
                "id":4,
                "p_name":"田**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"为啥买房总被中介牵着鼻子走？这些套路真的防不胜防！",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=4"
            },
            {
                "id":5,
                "p_name":"当**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"最穷上市公司老板被判终身市场禁入，账上仅余178元股东占用15亿",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517985988(1).jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pageone.html?id=5"
            }
        ];
        $scope.dataTwoList=[
            {
                "id":0,
                "p_name":"土豆",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"5G到底有多厉害？5G流量收费方式曝光！",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517986191.jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pagetwo.html?id=0"
            },
            {
                "id":1,
                "p_name":"地瓜",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"大地震！谷歌突然宣布！华为懵了，百度、滴滴要哭了！",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517986244.jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pagetwo.html?id=1"
            },
            {
                "id":2,
                "p_name":"王**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"篡改驾驶培训学时:非法获利达1597万元,已被提起公诉",
                "url":"/webapp/m/hybrid/hyhtml/index/pagetwo.html?id=2"
            },
            {
                "id":3,
                "p_name":"赵**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "short_desc":"《歌手》里知名度不高的李晓东，人生经历过怎样的大起大落？",
                "url":"/webapp/m/hybrid/hyhtml/index/pagetwo.html?id=3"
            },
            {
                "id":4,
                "p_name":"当**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "short_desc":"最穷上市公司老板被判终身市场禁入，账上仅余178元股东占用15亿",
                "u_img":"/webapp/m/hybrid/img/mortgage/1517985988(1).jpg",
                "url":"/webapp/m/hybrid/hyhtml/index/pagetwo.html?id=4"
            }
        ];
    }
]);
/**-内容-**/
app.controller('aboutController', ['$rootScope', '$scope', '$http',
    function($rootScope, $scope, $http) {
         $scope.pageId=GetQueryString("id");
        $scope.pageList=[
            {
                "id":0,
                "p_name":"张**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"最近，二孩出生人数超过一孩的消息让很多年轻人十分伤感：没经济实力的年轻人不敢生，那些实力雄厚的中年人却在继续播撒他们的基因。但在此之前，另一条消息被大家忽略了，2017年江苏省的初婚年龄竟高达34.2岁！原来，不是不想生娃，得先结婚啊。晚婚晚育，这是一个全球化的问题。一方面，生活的压力，让年轻人不敢轻易结婚生育；另一方面，受教育程度的普遍提高，当年轻人更加独立地进入职场，结婚的需求相对减弱。在“婚姻市场”上，有个有趣的现象：很多看似普通的女生，能很快找到男朋友，毕业后也很快结婚；但有时候，班花都可能一直单身。其实，这都和大学的男女比例相关。<br/> <br/>近日，德国IZA劳动经济学研究所发布的一篇论文，就重点研究了大学男女比例对年轻人婚姻的影响。结果发现，女生比例越高的学校，女生就越难找到对象；而即便学校男生比例高，也不妨碍男生找对象。<br/> <br/>这到底是为什么呢？<br/> <br/>男女比例失衡耽误终身大事<br/> <br/>在中国，高中时期的“早恋”是不被提倡的。因此上了大学，找对象的重要性并不是亚于学业，都是终生大事。而大学期间的恋爱往往纯真烂漫，如果能找到未来的结婚对象，感情基础会相对稳固。然而，在同性扎堆的专业性大学里，找到心仪的另一半并不容易。2015年，中国高校新媒体联盟发布了全国719所高校男女比例排行榜：前十名中，4所师范类院校和4所外国语大学赫然在列。相反，排在榜单后10名的高校中，除1所刑事学院、2所体育院校外，其余7高校均为理工类大学。文科专业学校女生多、理科专业学校男生多，无论从经验上看，还是从数据看，这个现象都是普遍的。如果给这个榜单换一个名字——单身排行榜，可能也能成立。2017年11月，德国IZA劳动经济学研究所发布的一篇论文显示，女生比例越高的学校，女生就越难找到对象；而即便学校男生比例高，也不妨碍男找对象。虽然这份研究是基于德国的情况，但在中国，这种现象依然普遍。首先，从1977年到2011年，德国女大学生的比例从1/3上升到了48%，与此同时，工程专业以男生为主，人文学科女生为主，建筑、法律、医学等专业逐渐由男生专业变成女生专业。这和中国情况非常相似。研究员Nico Pestel通过数据分析发现，在女生多的学校或专业里，女生单身的可能性更高，女生比例每增加一个百分点，女生结婚的可能性就减少1.5个百分点；<br/> <br/>但男生却不受此影响，男生比例每增加一个百分点，男生单身的可能性减少0.6个百分点，而不结婚的比例减少0.4个百分点。也就是，男生越多，男生单身的可能性反而越低。因此，在理工科学校里，女生找到对象的可能性高于文科院校。究其原因，就要引用“择偶梯度”这个术语。<br/> <br/>这个术语是美国社会学家巴纳德提出的。他发现，在婚姻关系中，男性总是倾向于选择社会地位相当或较低、年龄较小的女性，而女性往往要求男性的受教育程度、社会地位、收入、年龄等等于或高于自己。<br/> <br/>因此，德国IZA劳动经济学研究所报告指出，在女性多的学校，女性要在本专业、本学校找到对象更加困难；而高学历男性的择偶范围则可以扩大到大学以外。<br/> <br/>选专业要看“婚姻市场”？      <br/> <br/>普遍认为，我们考什么大学，选什么专业，是基于对未来行业发展和就业情况的判断。也就是说，劳动力市场决定了一个专业的报考情况。     但是，研究院Nico Pestel却发现，“婚姻市场”也可能影响个人选择专业。例如，如果女生希望找到一个同样有大学文凭的对象，她很可能有意地选择女生少的专业和学校。因此，大学的男女比例不仅影响着”婚姻市场“，“婚姻市场”也会反过来影响大学的男女比例。   研究院分析德国工程专业的女生人数发现，上世纪70年代，工程专业的女生比例非常低，但到了2000年以后，工程专业的女生比例则增加了。      不过，“婚姻市场”并不是影响专业选择的主要因素，因为，考大学，尤其是在德国，并不是一件容易的事，需要层层筛选。能否拿到录取通知书，要受很多因素影响。     不过，仅从现象上看，中国最近几年理工科大学女生比例也也越来越多    此外，2016年万事达卡发布的“女性科技新力量”调查报告显示，中国15至19岁的女生中（即高中生），学习科学、技术、工程和数学（即理工科）类科目的人数达76%，居亚太地区首位。不过，理工科男女比例日趋均衡，是个可喜的趋势。但这一趋势发生的大背景则是，大学的“阴盛阳衰”，据中国教育部统计，自2009年普通本专科女生比重首次超过男生后，男女生数量差距越来越大。2016年，全国本科女大学生人数，比男生多出了111万，硕士研究生中，女生比男生多了10万。更高的学历，意味着女性未来在事业上有更多的进步可能；另一方面，按照“择偶梯度”理论，又可能造成择偶难问题。要在教育、事业、爱情和家庭之间找到平衡点，对个人来说，不容易，对一个社会来说，更是巨大的工程。"
            },
            {
                "id":1,
                "p_name":"王**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"大家都知道考驾照需要通过规定驾驶培训学时才能报考其他科目考试，但有些不法分子为了牟利篡改驾驶培训学时案件，最近被法院提出公诉，据报道称，江苏省宜兴市检察院近日依法以涉嫌提供非法控制计算机信息系统的程序、工具罪，对篡改驾驶培训学时案件的34名被告人提起公诉。   <br/><br/>据介绍，犯罪嫌疑人林某、卢某从2015年11月至2017年7月，招募多名员工，共同完成跑码机、电子围栏破解芯片、免指纹芯片、图片机等四类用于非法控制计算机信息系统的程序、工具的生产、销售工作。截至案发，犯罪团伙非法获利达1597万元。<br/><br/>据了解，上述程序、工具可通过植入的方式控制汽车驾校教练车上的车载无线终端，使车载无线终端上传错误的学时数据、GPS数据、车辆跑码数据等，以此帮助各地的驾驶学员减少培训时间，提前非法获得驾驶员考试资格。"
            },
            {
                "id":2,
                "p_name":"赵**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"前两场比赛下来积分垫底，在李晓东看来也是意料之中的事，“重要的是我来了，又开始唱歌了。”近日播出的《歌手》第三期，李晓东是返场歌手，没有竞演压力的他演唱了一首《心的祈祷》。即便要暂时告别这个舞台，他仍满怀热情，之前还发微博与网友约定“突围赛不见不散”。<br/>在今年《歌手》的舞台上，李晓东不是知名度最高的一个，甚至很多人此前都没有听过他的名字，但是凭借《后来》《消愁》两首歌，很多人记住了他的声音。上世纪80年代出道的李晓东，90年代时成为《校园民谣2》中的主力歌手，当时他的代表作品有《冬季校园》《关于理想的课堂作文》等。在和唱片公司约满之后，他曾在酒吧担任过驻唱，2004年转型幕后。<br/>虽然认为自己并不是一个“纯粹的民谣歌手但李晓东身上依旧带有鲜明的民谣气质，人生经历起起伏伏，在他看来，“哀怨”情绪也只不过是一瞬间的事，“我不是那种总想着为什么自己不红了的性格。我也不是有输赢心的人，打牌、下棋这种游戏我都很少玩。”李晓东说，他只是单纯喜欢着唱歌这件事。前两场比赛下来积分垫底，在李晓东看来也是意料之中的事，“重要的是我来了，又开始唱歌了。”<br/>在上周《歌手》第二场中，李晓东一身牛仔衣裤亮相，带着沧桑感演唱了一首毛不易的歌曲《消愁》。李晓东坦言，自己想在《歌手》舞台用这首歌致敬人生，因为歌里的每一句词都能让他对照到自己：“我对自己没有特多的总结和规划，挺随遇而安的。但是突然间有这么一首歌的歌词把我总结出来了，吓我一跳，所以觉得和这首歌特别有缘分。”<br/>“没人记得你的模样，三巡酒过你在角落，固执的唱着苦涩的歌，听他在喧嚣里被淹没”。在毛不易这首《消愁》中，同样唱着李晓东的故事。<br/><br/>很早的时候李晓东就听过这首歌，他跟当时《明日之子》的音乐总监是多年的朋友，比赛的时候，李晓东一听《消愁》，只有一个想法：天才出来了，“这歌肯定会红，结果人家（毛不易）拿了冠军。”后来李晓东在参加《歌手》的两次试音中，都唱了这首歌。“‘一杯敬自由，一杯敬死亡’，这十个字表达的意境所有的大师都可以描述出来，但能提炼出来这几个字太不容易了。”在李晓东看来，自由和死亡是人生必须面对的，“用敬酒的方式来表达，是契合我性格的。我爱喝酒，天天敬来敬去，也没想过要敬自由、敬死亡。”<br/>李晓东感叹着，毛不易23岁就写出来了《消愁》这首好歌，自己恐怕到83岁也写不出来。和曾经做幕后的职业经历相关，李晓东对于有才华的年轻人总是特别偏爱，“我俩都是生活中话不多的人，但他比我还腼腆。”<br/><br/>李晓东说，自己今年48岁了，人生起起伏伏，对《消愁》肯定有自己的理解，但他没想明白的是，毛不易是哪里来的这些感悟，“我想他再怎么样也不可能吃过什么苦，他的简历也就是正常的上学、上班。我问他怎么写的，我以为是他喝了酒想起什么事。他说就是比赛的时候老师说要新歌，他就写了。我就更崩溃了，他随时都能写。”尽管《消愁》和《后来》两首歌让很多人迅速喜欢上了李晓东的歌声，但前两场比赛下来，李晓东积分垫底。对此，李晓东说，他有心理准备，“我一直在做幕后，对自己两场下来的表现和结果是有理性分析的。我们这几个人，怎么算我垫底都是正常的，从知名度上看，没有什么人知道我。别说现场只有五百人，五万人也会是我垫底。”关于李晓东西直门桥底下唱歌，被发掘时光倒退三十年，那个时候，李晓东是红极一时的歌手。李晓东出道的故事相当“老套”，相当于在西门町路上逛街时被星探发现的林青霞。上个世纪80年代末，人们平时没有什么业余活动，吃完饭要不就家里看电视，要不就大街上遛弯。那个时候开始有了吉他和流行歌曲，像李晓东那个年龄的孩子，十六七岁的男孩就喜欢几个人晚上路边一起弹吉他唱歌，叼个小烟圈，是当时少年最酷的配置。李晓东就是这样，和小伙伴们一起在西直门桥下唱歌时，被星探发现了。《星座》<br/><br/>“其实那个人来听过好多次我们唱歌了。他后来又专门听了听我的歌，说不错可以给你录磁带。那个时候‘录磁带’这事儿，听起来多洋气！”就这样，李晓东出了第一盘专辑《星座》，一夜之间就火了。此后《星座》系列连续出到《星座3》，从未有过专业音乐背景的李晓东还专门请了音乐老师补习了一两年。1994年，签约大地唱片公司。艺人供图<br/><br/>1994年，李晓东正式签约香港大地唱片公司，大地也是当时最好的唱片公司。同年，大地发行了《校园民谣2》，在当时并不算“校园歌手”的李晓东成为了专辑《校园民谣2》的主角，演唱了高晓松、郁冬和沈庆三人的作品，造就了《冬季校园》《关于理想的课堂作文》《没有想法》《老屋》等校园民谣代表歌曲。<br/>《给我你的爱》<br/>《校园民谣2》<br/><br/>李晓东和大地的合约签了三年，三年后，公司没有续约。“那个时候我才二十几岁，稀里糊涂的，也没有想过利用资源自己再接着做下去。”<br/>在大地期间，无论是演唱会、演出，还是媒体采访，都是直接跟公司对接。约满后，很快演出就不再有了。“而且还不是逐渐减少，是一下子就没有了。歌手没演出就只剩下待着了。”<br/>李晓东闲了大半年。<br/>1998年4月，“男孩女孩”酒吧的老板找到李晓东，“他（酒吧老板）之前做电台节目，跟我也认识。后来他想做酒吧现场演出，找我帮他组乐队。”上世纪90年代末，市面上流行的夜间娱乐场所还是夜总会，酒吧听起来时尚而高端，也没有哪个酒吧搞演出，这让李晓东觉得新鲜而有趣。<br/>“他也没想到我能答应，因为那个时候觉得签约歌手地位还挺高的。我那时已经闲待了大半年，还挺慌的，也没攒钱，需要赚钱。人家钱也给的挺好，又能玩乐队，多好。” 艺人供图李晓东说，做事“好玩”对他是一个很重要的条件，而且他对“签约歌手唱酒吧”这事，一点不介意。“我之前就听田震说过，在伦敦酒吧喝酒，一回头sting在后面唱歌呢。”这也让李晓东觉得，在酒吧唱歌神秘又浪漫。<br/>李晓东组建的乐队在酒吧一唱就火了。李晓东说，酒吧的舞台跟观众很近，人多的时候从舞台走到门口却需要十分钟，“你想想那得多少人。”那段时光很欢乐，每天半夜十二点半演出结束，大家一起去簋街喝酒。<br/>那个时候去酒吧的人大多是白领，当时在人均每个月几百块工资的情况下，酒吧里啤酒四十多一瓶，算是相当高端的消费场所。有客人每天都来，而且每天都是同一个时间来，一来来两年，直到有一天突然再也不出现了，这些场景听起来都像老电影中的画面。李晓东笑着回忆，每天来酒吧的客人中有各种大老板，总喜欢点同一首歌听，比如beyond的《不再犹豫》，“每天就要听这一首歌，然后全场大合唱。”李晓东自己喜欢唱的都是老歌，李寿全的《张三的歌》、刘文正的《雨中即景》、潘安邦的《恰似你的温柔》，非常受欢迎。因为酒吧生意好，后来陆续在青岛、深圳都开了分店，还成立了“男孩女孩”音乐公司，其中各种琐事李晓东都得管。复出原因 想让儿子过的更好这些年，李晓东的日子像一个普通上班族一样稳定、平凡。平时做一些音乐的幕后工作，辅导一下年轻人，更多的时间回归家庭。<br/>李晓东在他47岁时有了儿子，此次决定从幕后走到台前，他坦言也有部分原因是为了儿子，“如果我上这个节目让大家都知道，又让很多观众重新回忆起了过去，有了一些知名度，带来一些演出，我也可以多赚一点钱补贴家用，对儿子今后的生活、教育各方面应该都能起到好的作用。”<br/>李晓东和儿子。图片来自艺人微博<br/><br/>儿子如今14个月大，还看不懂电视节目，看到《歌手》中的李晓东，对他来说跟和爸爸通视频没有什么区别。这个时候儿子就会向平时视频通话一样，跟电视里的李晓东招手。<br/>提到儿子，李晓东眼睛里都是笑，“哎，就是现在忙起来没时间陪儿子了。过了这一阵子应该好一点。”李晓东说，如果能再重新站在台上唱歌，收入跟目前比肯定是不一样的，“大舞台上唱歌赚钱多一点，孩子生活条件、教育条件都好一点。我有时候想，他上大学我都70岁了，我还能为他做些什么呢？”  <br/>回忆起自己出道这三十年的起落，出过唱片、唱过酒吧，也开过班传授声乐技巧、给其他歌手做过音乐总监，反反复复中他发现，自己最喜欢做的事情还是唱歌。“如果可以被更多人接受，当然希望一直唱歌。我真的非常想唱歌，也喜欢唱歌，这是我活了快五十年可以做到的最好的一件事。”"
            },
            {
                "id":3,
                "p_name":"李**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"据悉，2017年北京3家影院存在偷、漏、瞒报票房收入的行为，被处以5万元以上的行政处罚。自2017年3月1日《中华人民共和国电影产业促进法》颁布实施后，执法部门对电影院经营中是否存在偷、漏、瞒、虚报票房收入情况进行严格监管。<br/><br/>为什么制片方宁可多交税也要虚报票房，真的跟股票和口碑有关吗?有人说导演是为了巩固自己的地位才去造假票房，提高口碑。但是在我看来有些导演已经足够有地位了，难道他们真的这么在乎这几个数字背后的地位吗?还有如何看待票房造假呢?<br/><br/>我国电影的利润分配是：电影净利润=票房收入—国家电影专项资金税，国家电影专项资金=票房收入X3.3%，折两部分是需要上交国家的，所以这方面说，虚报瞒报电影票房，就是偷税漏税。偷税漏税这一行为在我国是违法的，必须受到惩治。电影虚假票房必须要制止，为了健康公平和谐的中国电影圈，为了电影行业的公平竞争。<br/><br/>同一个行业内，有人走了偏门，肯定会伤害其他遵纪守法的制作人，是一种不公平的恶性竞争。我国电影逐渐走向正轨，如果不加以遏制不良情况发生，定会导致中国电影市场糜烂，产房、院线、观众都会受到不利影响。"
            },{
                "id":4,
                "p_name":"马**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"随着房地产由售转租，大城市人口逐渐趋于稳定，商品房逐渐由新房市场为主转变为以二手房市场为主。2017 年，北京、上海、广州、深圳的二手房交易量分别达到新房的3.3 倍、1.1 倍、1.7 倍和2.7 倍。而整个2017年，有超过24个城市二手房成交量超过新房，部分三线城市也加入这个行列，比如常州、中山、扬州、绍兴、三明等城市。在二手房市场中，房产中介是绝对绕不开的话题，他们掌控了交易渠道，帮助购房者挑选房屋，帮助房主找到合适的购房者。<br/>百客君要说的是，房产中介并不是希望把房价炒高，他们的目的是尽可能促成多的交易，他们的收入主要来自于佣金。所以为了促成二手房交易，他们会带购房者看很多的房子，每天打很多的电话确认买家和卖家的需求，在看房、谈判和成交等阶段，中介要掌握进度，通过一系列手法促成交易。这是一般房产中介的工作流程。作为购房者，你从跟着房产中介看房开始，就已经进入房产中介的“节奏”了。<br/>一、带看环节，房产中介常见的手法<br/>1、你去中介门店看房，中介为了留住你，一般会抛出一套“价格特别合适”的房源，临看房的时候，可能会出现一些意想不到的状况，比如中介到跟前儿才会告诉你，这套房是已购公房、经适房、不满两年的商品房等等，房子便宜，但交易成本高。又或者临时接个电话，然后就说房子已经售出等等。<br/>通过这种手法，中介可以转而推荐他想尽快卖出去的房子。<br/>2、中介带看房，是有讲究的，比如他带你看三套房，会将最符合你需求的房子留在最后。第一套房会让你感觉一般，第二套房会更差，第三套房最好，有了落差，才能加强你的购房欲望，以促成交易。中介不会带你看很多套房，看多了，心累疲乏，反而不容易促成交易。<br/>3、带看过程中还会营造房源很抢手的气氛，比如找其他中介小哥帮忙配合，你在看房的过程中，其他中介也带人来看房，而且专门挑你最中意的房子看。<br/>4、当你看完所有房源，觉得有一套特别中意的时候，中介还会带你发掘这套房的更多优点，比如周边的各种成熟配套。<br/>二、房子看完了，还有个更重要的环节，那就是“逼定”<br/>“逼定”是销售行业的术语，具体到房地产环节，他们“逼定”的手法包括但不限于以下这些：<br/>1、当你看上了某套房但报价与房主挂牌价差距较大时，中介往往直接否定，给出的理由通常是最近成交的类似房源，成交价都比你出的价格高，目的是让你出更高的价格。<br/>2、如果你出的价格与房主挂牌价比较吻合，这时候中介要做的就是尽快锁定交易，催促你交订金。<br/>催促你交定金的方式也有很多，玩心理战的比较多。比如某套房有很多人都盯着，中介会说“有看房客户要求中介不要再带人来看房了”“XX房子性价比很高，有看房客户已经在和业主谈了”，谁先交定金，谁就能拿下房子。<br/><br/>二手房交易过程中，最大的弊端就是信息壁垒，购房者和房主直接沟通成本很高。中介通过建立这个信息壁垒优势来确保自己的利益。不能说中介一定会把差的房子卖给购房者，已达到什么目的。但知道这些二手房中介的手法，买二手房也会买得更安全更踏实。"
            },
            {
                "id":5,
                "p_name":"杨**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"　“双11”消费盛宴转眼将至，历年来，“双11”带动电商、物流、金融理财等行业的营销热潮，2017年“双11”新的销售记录势必继续刷新。<br/>《每日经济新闻》记者梳理了近五年来阿里平台上的保险销售情况，发现“双11”保险发展路径。从2012年的理财型保险产品爆发，连续两年创造了亿元级销售神话，此后华泰保险、众安保险主推的退货运费险“以量取胜”，单日成交量从2013年的1.5亿笔、到2014年的1.86亿笔、再到2015年的3.08亿笔。2016年，消费类保险这一大类险种创造了单日6亿笔的记录，成为全球保单量最大的险种。一位保险业内人士对《每日经济新闻》记者表示：“这种依托特定场景和中介平台的保险产品肯定会越来越多，因为消费行为的多元化需要这些产品。同时，大数据技术也在完善，也给了这些产品的诞生提供了技术依托。”还有业内人士判断：“未来围绕消费者担心点，促进其放心消费的综合型的消费保险潜力最大。”理财险抢蹭互联网消费热<br/>令人印象深刻的是，国华人寿2012年12月曾创造了“三天一个亿”的销售记录，引来不少保险公司跟随，理财保险的预期收益率在2013~2014年最高超过了7%。<br/>2013年“双11”，国华人寿以万能险——“华瑞2号”为主打产品，据介绍，“华瑞2号”预期年化收益率为7%，限量10亿元，投资期限一年，资金门槛1000元。该产品创造了“开卖十分钟，保费过亿元”的销售神话。<br/>国华人寿的“战绩”让同业惊羡不已。2014年，越来越多保险公司主动参与“双11”营销，不少公司争相打出“双11特供”、“理财专场活动”等口号。在“暗战”不断的车险营销中，平安、人保、太保、阳光、安盛天平等险企纷纷推出了大礼包、返集分宝等活动，带动车险销售数据急剧上涨。2014年“双11”当天，中国平安(64.020,-0.04,-0.06%)官方旗舰店于11月11日上午9：35实现总成交金额过亿元。值得一提的是，作为大型金融集团的中国平安有意对标“双11”，在2014年12月上线了“金融双11”活动——“财神节”，调动旗下产险、寿险、银行、证券、陆金所等17个业务单位的18款爆款理财产品，拉开了一场互联网金融产品营销大战，前4天累计销售额就达到了587亿元。<br/>“理财险借助‘双11’电商热潮网络销售，本质上也是和理财险在保险公司的定位和作用相吻合的。”对于车险也来蹭电商消费的热潮，慧择保险用户服务中心顾问总监吕亚表示：“车险本身就是一种刚性需求，借助‘双11’整个互联网狂欢的氛围，打出折扣、优惠活动，这也一定可以吸引到足够多消费者热情参与。”不过，基于监管层对网销理财类保险产品的规范和整顿，2015年，网销万能险大范围下架，在售的万能、投连险数量大幅减少，高收益理财险退出“双11”营销主战场。<br/>在吕亚看来，随着监管层对于“保险姓保”基调的定位，保险相关产品设计的新定位，通过网络的大规模自主销售还需要一段路来走。”<br/>退运险打开消费保险想象空间<br/>消费保险的兴起始于退货运费险，2013年“双11”，华泰保险的退货运费险单日成交1.5亿笔，保费收入近9000万元。根据当时的投保原则，退货运费险不能单独购买，其投保内嵌于网络交易之中，和整个网购环节形成一个完整的购物流程。网络购物行为发生后，因实物与网上展示不符或买家与卖家协商一致等其他原因，买家在约定的退货期间内退货，且卖方允许买家退货并承诺返还货款的，保险人将按照保单约定的金额进行赔偿。<br/>退货运费险因满足买家网购退换货的需求，成为了此后“双11购物节中的必备产品，并不断地创造奇迹。2014年，由阿里参与发起设立的众安保险发力退货运费保险，与华泰保险一起在“双11”当天创造了“保单量突破1.86亿笔，保费破亿元”的成绩。退货运费险单件价格低，但在“双11”交易中水涨船高，保费逐渐攀升。<br/>2015~2016年，太保、国泰产险等保险公司相继参与到“双11”退货运费险销售中。2015年“双11”，退货运费险当天的销售数据为3.08亿笔，以件均保费约0.5元钱计算，实现保费收入可达到1.5亿元。到了2016年“双11”，阿里平台实现的退货运费险的保费数据不再被提起，包含“退货运费保险”的消费类保险创造了单日6亿笔的记录，成为全球保单量最大的险种。<br/><br/>所谓的“消费保险”，是伴随着互联网购物浪潮下的创新险种的统称，其利用保险机制促进消费达成，从价格、质量、物流、售后等等环节提升消费体验，化解售后纠纷。"
            }
        ];
        var pas=parseInt($scope.pageId);
        var ts=$scope.pageList[pas].content;
        $("#artitle").html(ts);
        $scope.pageOneList=[
            {
                "id":0,
                "p_name":"土豆",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"今年是手机行业的一个分水岭，因为明年也就是2019年5G网络就要正式商用了，而到时候会有一大把的5G手机上市。不知道大家还记得曾经4G网商用和4G手机上市时的场景吗？记得那是在2013年，刚好iPhone5S上市时，结果没到1年，市面上几乎所有不支持4G网的3G手机就全部淘汰了。首先需要阐述一下5G是什么，牛逼在什么地方？<br/><img src='/webapp/m/hybrid/img/mortgage/1517986191.jpg'width='100%' height='100%'/><br/>我们小老百姓对于这些东西完全没有概念，那么举一个栗子：2G网络的时候大家的体验因该是可以发短信，打电话，3G的时候是可以使用手机浏览网页，速度还是非常慢的。当4G诞生的时候大家天天拿着手机到处看视频，互相视频聊天通信。那么5G的时候可以做什么？5G的最高峰值网速可以达到10G，那么这么高的速度，我们可以达到支持高清视频播放，轻松无压力。<br/>5G网商用，5G手机上市后，估计也会和那个时候差不多，所有厂商和渠道商，运营商，都会逐渐的淘汰4G网和4G手机。5G开发商大户，华为中兴已经开始着手准备相关测试，还有很多专利已经得到注册，也就是大部分核心中国已经研发出来了，那么美国想要使用就绕不开华为和中兴。<br/>不久前高通在京举办2018中国技术与合作峰会，联合多家中国厂商共同推出5G领航计划，宣布合作支持5G时代中国智能手机产业的发展。小米、中兴联想，OPPOvivo等厂商均称将第一批推出5G手机。<br而华为表示自己的麒麟处理器将会在2019年下半年支持5G网，并推出首款5G手机，而苹果申请测试5G网络也获得美国政府部门的批准，意味着该公司也将探索推出5G版iPhone，有预测称，2019年苹果可能推出3款5G版iPhone。<br/><br/> 但是有一个问题就来了，5G网的的速度相比4G网的进化，可比4G网较3G网要快的多了。对于用户而言，5G最直观的感受是极快的网速和极低的延迟，通过5G网络，手机可以不到2秒下载一部6GB电影。在5G时代，一眨眼的功夫几个GB的流量就已经用完<br/>那么，5G网的资费怎么算？我们老百姓会用不起吗？运营商人士表示，随着5G技术的普及，资费会进一步下降，服务将进一步提升，而且也将出现更多的应用场景，可能会超乎我们的想象。如同4G时代，共享单车、手机外卖、手机支付等产品和服务的诞生未来在5G的整体环境下，不仅是手机需要流量，其他设备也需要，流量计算变得比较复杂，最终的计费也会变得相对复杂，可能会采用综合计费法。综合计费法是个不错的选择，能够让流量资费分工更明确，收费更合理，类似于现在的日租卡。所以总体来说，5G时代来临后，手机上网资费不会比现在更贵，而是更便宜或是保持不变，怎么样？大家放心了吧？小编很是期待高新科技早日应用到日常生活中，你怎么看？"
            },
            {
                "id": 1,
                "p_name": "地瓜",
                "pic": "/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"羞答答的玫瑰静悄悄地开！<br/>去年，无人驾驶搞得如火如荼，全球市值第二高的科技巨头谷歌却一副“性冷淡”的模样！直到今天，一切揭晓时，大家才知道，原来，谷歌一直在闷声大发财，悄悄地在背后不吭声地发力！刚刚，谷歌正式宣布：将在今年（2018年）商业化其无人驾驶出租车业务。<br/>怎么个商业化？谷歌说得很明白：2018年再次生产数千辆自动驾驶汽车，投入到出租车运营中去。<br/>这个数千究竟是几千，谷歌也没有说清楚。但按常规推算，起码3000辆以上。<br/>去年11月，谷歌投入的试运营车辆是500辆，不到三个月时间，又增加了数倍；按照这个速度，一旦这3000辆试运营的效果OK，将很快增加到“上万辆”、“数万辆”！<br/>一石激起千层浪！谷歌公布的这个信息，透露出了无限玄机：<br/><br/><img src='/webapp/m/hybrid/img/mortgage/1517986244.jpg'width='100%' height='100%'/><br/> 谷歌已经突破了技术屏障。谷歌能够有那么多无人驾驶车上路，说明已达谷歌无人驾驶，已经到了实际运用阶段了。而这密密麻麻的无人驾驶出租车上路，也将给谷歌提供大量的数据反馈，让其技术迅速改进。谷歌很快也将突破法律屏障。人类司机大约每行驶1—2亿英里的概率里会撞死一个人，因此，业界认为自动驾驶系统测试里程需要到2亿英里，才能证明其安全性。现在，谷歌这个数量级的车队上路，要通过这种“人肉测试”，将是分分钟的事。这也就是说，谷歌在今年商业化无人驾驶出租车业务，的确不是它在吹法螺；大批量商用的谷歌自动驾驶出租车，真的是很快要来了。<br/>措手不及！沉默已久的谷歌，今天终于憋出了大招，开始了绝地反击！<br/>这将是一场刺刀见血的厮杀！<br/>今天，最焦虑的，当数百度、华为和滴滴了。<br/>对于百度、华为这两家能在无人驾驶技术方面，堪与谷歌PK的中国公司来说，他们估计得经历一段“苦难行军”了。无人驾驶领域，将是一个“头部通吃”的领域。他们必须走得更快，干得更拼命，才能抢在谷歌之前，占据有利地形，组织有效反攻。今夜，滴滴或也将彻夜难眠，他们即将迎来生死时速。拥有无人驾驶技术的谷歌，将在打车、分时租赁、租赁等各个维度强势进入。想想吧，有了不知疲惫、无限供应机器人司机，滴滴这些公司，还怎么玩？写到这里不禁感慨：这真是一个充满不确定性的时代。<br/>随着技术和新产品更新迭代的几块，当今世界上的任何企业，都是面临一个危机四伏的世界，没有谁可以一劳永逸地活下去，没有谁离死亡不是一步之遥而已。<br/>如果说以前时代里的企业竞争，只是平面二维的、同行业之间的竞争，这个时代的企业竞争，则是三维、四维乃至更高维度的跨界竞争！<br/>降维打击是无比暴力也无比血腥的，它将让很多如日中天的企业，分秒之间突然陨落，上演高台跳水的悲剧，无可奈何花落去！<br/>向前一步是幸福，退后一步是黄昏，关键处行差还是走对，靠的，就是中国企业家的战略思考和把握。<br/>祝福中国企业家们！<br/>"
            },
            {
                "id":2,
                "p_name":"花花",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"在过去一年的知识付费领域，罗辑思维推出的得到异军突起，喜马拉雅上的付费专区和知乎Live表现不错。作为知识付费的先行者，分答在经历47天关停后，却旋即沉默下来。<br/> <br/><img src='/webapp/m/hybrid/img/mortgage/1517986268.jpg'width='100%' height='100%'/><br/>昨天（2月7日），沉寂一年多的姬十三少见地穿了西装，站到台前。过去一年，他将“分答”“在行”品牌统一，把产品升级，他准备签100个优秀的知识提供者，还要做直播答题。<br/>“2018年年，知识付费将变成全面的知识经济。这一领域不会出现寡头，5到10家甚至更多公司会有机会。”显然，在他看来“在行”会是其中之一。<br/>在行的知识付费生态<br/> 时间回到一年半前。“请问作为亚洲首富的儿子，您的人生还有什么买不起的？”关于王思聪的几个问题，直接让分答的各项数据冲上了历史最高峰。<br/>分答早期的厉害之处在于能在较长的一段时间内，不断运营出新的话题点，消费的对象也从王思聪转移到佟大为、木子美等明星网红身上。<br/>基于明星效益和粉丝经济，初期的分答更容易发展成为一个提供轻娱乐轻社交的问答社区，以社交为主，知识回答为辅。<br/>但姬十三坚持选择相比较漫长而纠结的知识付费。“分答的核心是，各个领域里的专业人士在给大家提供各种各样的帮助和建议。”姬十三当时说道。<br/>一年半后，再次站到台前的姬十三，说辞不变，并且他给“分答”以及公司旗下另一款产品“在行”，赋予了一个更宏大的愿景——提供全场景的知识付费服务。<br/>出于品牌统一的需要，“分答”也正式更名为“在行一点”。<br/>姬十三在发布会上同时宣布“行家孵化计划”，在行平台将在2018年内签约至少100名行家，提供资金、流量以及个人品牌的支持。<br/>“今天，我们为什么要去签约行家，因为我们要优先发现一些优秀的知识输出者，在他们跨平台输出之前，先把他们集中起来。”姬十三说。<br/>去年8月份，今日头条旗下的悟空问答与知乎爆发大V争夺战。双方依靠补贴，对优秀问答者签约。<br/>但姬十三说，在行与今日头条们要签的不是同一批人，合作的内容也不同。对于签约对象，姬十三没有明确回答筛选标准，但他提及“对我们来说，大学老师会成为知识输出的主要人之一。”<br/>对于合作方式，姬十三表示：“知乎跟用户的关系就跟你跟微博的关系一样，你只是输出者。今日头条是要求签约者，一个月在今日头条里面每天回答多少个问题，这些回答不能在其他地方重复发表，这是松散的条约，你还可以在其他地方回答其他问题。而我们会深入到行家个人品牌的打造，并且会跟他签署几年的排他协议。”<br/>除此之外，近来火爆的知识答题，在行也宣布加入战局，推出基于小程序的游戏化学习产品——“我最在行”知识对战，设置十余个主题擂台，并分别提供奖金。<br/>姬十三希望将知识答题演变成学习的一种方法，“直播答题往前走，会变成直播娱乐，或者视频App，直接当成自己的流量。但我们不可能变成一家娱乐公司，小程序对战模式会演变成一种游戏化学习，通过游戏来学习一些新的知识，这个东西是跟在行一致的。”<br/>当前，直播答题的难点在于如何增强用户粘性，毕竟奖金刺激的方法难以持久。对此，姬十三坦言在行也还没有找到答案。<br/>"
            },
            {
                "id":3,
                "p_name":"佳佳",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"快车、出租车、拼车、共享单车，美团摩拜嘀嗒易到全线围剿滴滴<br/>上海的朱师傅一直在等待，他在等美团打车上线的那天。<br/>起初，朱师傅是开滴滴专车的。几个月前，因为口音和问候术语不专业的问题，他从滴滴离开，转而成为首汽约车的司机，但他依旧觉得不够赚钱。不久前他听闻，美团打车只要8%的佣金抽成。<br/>这个消息同样吸引了其他司机的关注。北京的滴滴快车司机王师傅也对美团打车心心念念，他期待出现竞争，像曾经Uber和滴滴那样的竞争。他粗略地算了一笔账，以自己现在北汽新能源车为例，开滴滴每天的抽成后收入大约200多元，开美团大约300元——不算补贴，仅美团抽成少这一点，他一天就可以多赚100元。<br/>但这一天并没如期到来。美团打车原计划1月12日在北京正式上线——但是因为政策许可原因，春节前你恐怕都很难在北上看到美团打车的影子。不过，美团进入北京，是必然之事。<br/>对滴滴来说，美团是个强劲的对手。滴滴所处的网约车领域刚刚安静下来不久，它和Uber中国的恶战似乎还历历在目。<br/>很多人替滴滴出行创始人兼CEO程维焦虑，“如果我是程维，现在晚上一定睡不着觉”。他们看到的不只是美团打车的入侵，还有网约车、单车领域在近半年来的格局变化，神州专车上市、易到用车重生、首汽约车融资，就连共享单车领域里的摩拜，都展现了做全方位出行平台的野心。<br/>除外，曹操专车进军北京，在线旅游平台去哪儿计划扩张专车业务场景，嘀嗒拼车也开始以出租车为切口发起反击。快车、专车、顺风车、出租车，看起来滴滴的每个主营业务都面临着挑战。这一切，让网约车市场充满了变数。<br/>“滴滴可能是有史以来竞争最惨烈的公司。”程维在接受《财经》杂志采访时说道，但这并不影响他对滴滴战略布局的判断。对于美团的入侵，他看起来毫不在意，“美团肯定不是最弱的，但也未必是最强的。中国有350个网约车平台你知道吗？多一个竞争者而已。”<br/>在这些回答的最后，程维引用了成吉思汗西征时的战书：尔要战，便战。"
            },
            {
                "id":4,
                "p_name":"田**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"随着房地产由售转租，大城市人口逐渐趋于稳定，商品房逐渐由新房市场为主转变为以二手房市场为主。2017 年，北京、上海、广州、深圳的二手房交易量分别达到新房的3.3 倍、1.1 倍、1.7 倍和2.7 倍。而整个2017年，有超过24个城市二手房成交量超过新房，部分三线城市也加入这个行列，比如常州、中山、扬州、绍兴、三明等城市。在二手房市场中，房产中介是绝对绕不开的话题，他们掌控了交易渠道，帮助购房者挑选房屋，帮助房主找到合适的购房者。<br/>百客君要说的是，房产中介并不是希望把房价炒高，他们的目的是尽可能促成多的交易，他们的收入主要来自于佣金。所以为了促成二手房交易，他们会带购房者看很多的房子，每天打很多的电话确认买家和卖家的需求，在看房、谈判和成交等阶段，中介要掌握进度，通过一系列手法促成交易。这是一般房产中介的工作流程。作为购房者，你从跟着房产中介看房开始，就已经进入房产中介的“节奏”了。<br/>一、带看环节，房产中介常见的手法<br/>1、你去中介门店看房，中介为了留住你，一般会抛出一套“价格特别合适”的房源，临看房的时候，可能会出现一些意想不到的状况，比如中介到跟前儿才会告诉你，这套房是已购公房、经适房、不满两年的商品房等等，房子便宜，但交易成本高。又或者临时接个电话，然后就说房子已经售出等等。<br/>通过这种手法，中介可以转而推荐他想尽快卖出去的房子。<br/>2、中介带看房，是有讲究的，比如他带你看三套房，会将最符合你需求的房子留在最后。第一套房会让你感觉一般，第二套房会更差，第三套房最好，有了落差，才能加强你的购房欲望，以促成交易。中介不会带你看很多套房，看多了，心累疲乏，反而不容易促成交易。<br/>3、带看过程中还会营造房源很抢手的气氛，比如找其他中介小哥帮忙配合，你在看房的过程中，其他中介也带人来看房，而且专门挑你最中意的房子看。<br/>4、当你看完所有房源，觉得有一套特别中意的时候，中介还会带你发掘这套房的更多优点，比如周边的各种成熟配套。<br/>二、房子看完了，还有个更重要的环节，那就是“逼定”<br/>“逼定”是销售行业的术语，具体到房地产环节，他们“逼定”的手法包括但不限于以下这些：<br/>1、当你看上了某套房但报价与房主挂牌价差距较大时，中介往往直接否定，给出的理由通常是最近成交的类似房源，成交价都比你出的价格高，目的是让你出更高的价格。<br/>2、如果你出的价格与房主挂牌价比较吻合，这时候中介要做的就是尽快锁定交易，催促你交订金。<br/>催促你交定金的方式也有很多，玩心理战的比较多。比如某套房有很多人都盯着，中介会说“有看房客户要求中介不要再带人来看房了”“XX房子性价比很高，有看房客户已经在和业主谈了”，谁先交定金，谁就能拿下房子。<br/><br/>二手房交易过程中，最大的弊端就是信息壁垒，购房者和房主直接沟通成本很高。中介通过建立这个信息壁垒优势来确保自己的利益。不能说中介一定会把差的房子卖给购房者，已达到什么目的。但知道这些二手房中介的手法，买二手房也会买得更安全更踏实。"
            },
            {
                "id":5,
                "p_name":"当**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"*ST华泽的股价已经沉睡了将近两年，但在场外，这家上市公司屡屡上镜。<br/>2月6日，证监会在公布了2018年1号《中国证监会市场禁入决定书》（下称《禁入决定书》），对华泽钴镍在2013-2015年关联交易及年报造假等行为做出处罚，公司时任董事长王涛被采取终身证券市场禁入措施。<br/>这不是*ST华泽首次成为焦点。国信证券因华泽钴镍重组案被查、基金下调股票估值至61个跌停、费用不足公司网站被关、账上仅余178元，内外交困的华泽被网友称为“最穷上市公司”。<br/>父子操纵关联交易 99%应收票据无效<br/> <br/><img src='/webapp/m/hybrid/img/mortgage/1517986026(1).jpg'width='100%' height='100%'/><br/> 证监会表示，华泽钴镍在2013年至2015年，通过全资控股企业陕西华泽，与星王集团等关联法人进行关联交易，并向其提供资金。2015年财报显示，公司实际控制人通过名下陕西星王企业集团有限公司违规占用*ST华泽14.97亿元。<br/>为掩盖关联方长期占用资金的事实，华泽钴镍时任董事长王涛安排人员搜集票据复印件，将无效票据入账充当还款，导致2013年、2014年年报以及2015年半年报中均存在虚假记载。据证监会披露的数据，在上述每个报告期，华泽钴镍均存在超过10亿元的无效票据，超过当期应收票据期末余额的99%。此外，华泽钴镍还存在未及时披露担保事项等问题。<br/>《禁入决定书》称，王涛在担任华泽钴镍董事长期间同时担任星王集团经理。而值得注意的是，王涛的父亲王应虎则在彼时兼任华泽钴镍副董事长和星王集团的法定代表人。<br/>2016年3月，王涛被证监会调查。两个月后，华泽钴镍发布公告，王涛因“个人原因”辞去公司董事长职务，董事长职务由王应虎代行。<br/>除对王涛采取终身市场禁入之外，证监会对王应虎也处以10年证券市场禁入。2月1日，华泽镍钴发布公告称，截至调查结束，仍有3亿票据尚未收回，由于担保事项等违规行为给公司带来或有负债的情形尚未消除。<br/>AI财经社此前发现，华泽的官网（www.hznc.com.cn）也无法访问，*ST华泽通过互动易平台回应称：公司网址因欠费暂停。<br/>上例终身禁入在去年底<br/><br/><img src='/webapp/m/hybrid/img/mortgage/1517985988(1).jpg'width='100%' height='100%'/><br/> 据《信息时报》报道，2017年共有10人被处以终身禁入市场，罚单数量、金额也远超往年。<br/>上一次终身禁入发生在2017年12月，江苏雅百特科技股份有限公司时任董事长陆永因公司虚构海外工程项目、虚构建材出口贸易、虚构国内建材贸易等方式虚增收入，被证监会采取终身市场禁入措施。<br/>此外，勤上光电在1月15日公告称，收到证监会《行政处罚及市场禁入事先告知书》，指勤上股份未按规定及时披露信息并存在虚假记载。证监会表示，公司实际控制人李旭亮对此负有重大责任，并曾两次被证监会行政处罚，拟决定对其采取终身证券市场禁入措施。<br/>"
            }
        ];
        var pas=parseInt($scope.pageId);
        var ts=$scope.pageOneList[pas].content;
        $("#artitle1").html(ts);
        $scope.pageTwoList=[
            {
                "id":0,
                "p_name":"土豆",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"今年是手机行业的一个分水岭，因为明年也就是2019年5G网络就要正式商用了，而到时候会有一大把的5G手机上市。不知道大家还记得曾经4G网商用和4G手机上市时的场景吗？记得那是在2013年，刚好iPhone5S上市时，结果没到1年，市面上几乎所有不支持4G网的3G手机就全部淘汰了。首先需要阐述一下5G是什么，牛逼在什么地方？<br/><img src='/webapp/m/hybrid/img/mortgage/1517986191.jpg'width='100%' height='100%'/><br/>我们小老百姓对于这些东西完全没有概念，那么举一个栗子：2G网络的时候大家的体验因该是可以发短信，打电话，3G的时候是可以使用手机浏览网页，速度还是非常慢的。当4G诞生的时候大家天天拿着手机到处看视频，互相视频聊天通信。那么5G的时候可以做什么？5G的最高峰值网速可以达到10G，那么这么高的速度，我们可以达到支持高清视频播放，轻松无压力。<br/>5G网商用，5G手机上市后，估计也会和那个时候差不多，所有厂商和渠道商，运营商，都会逐渐的淘汰4G网和4G手机。5G开发商大户，华为中兴已经开始着手准备相关测试，还有很多专利已经得到注册，也就是大部分核心中国已经研发出来了，那么美国想要使用就绕不开华为和中兴。<br/>不久前高通在京举办2018中国技术与合作峰会，联合多家中国厂商共同推出5G领航计划，宣布合作支持5G时代中国智能手机产业的发展。小米、中兴联想，OPPOvivo等厂商均称将第一批推出5G手机。<br而华为表示自己的麒麟处理器将会在2019年下半年支持5G网，并推出首款5G手机，而苹果申请测试5G网络也获得美国政府部门的批准，意味着该公司也将探索推出5G版iPhone，有预测称，2019年苹果可能推出3款5G版iPhone。<br/><br/> 但是有一个问题就来了，5G网的的速度相比4G网的进化，可比4G网较3G网要快的多了。对于用户而言，5G最直观的感受是极快的网速和极低的延迟，通过5G网络，手机可以不到2秒下载一部6GB电影。在5G时代，一眨眼的功夫几个GB的流量就已经用完<br/>那么，5G网的资费怎么算？我们老百姓会用不起吗？运营商人士表示，随着5G技术的普及，资费会进一步下降，服务将进一步提升，而且也将出现更多的应用场景，可能会超乎我们的想象。如同4G时代，共享单车、手机外卖、手机支付等产品和服务的诞生未来在5G的整体环境下，不仅是手机需要流量，其他设备也需要，流量计算变得比较复杂，最终的计费也会变得相对复杂，可能会采用综合计费法。综合计费法是个不错的选择，能够让流量资费分工更明确，收费更合理，类似于现在的日租卡。所以总体来说，5G时代来临后，手机上网资费不会比现在更贵，而是更便宜或是保持不变，怎么样？大家放心了吧？小编很是期待高新科技早日应用到日常生活中，你怎么看？"
            },
            {
                "id": 1,
                "p_name": "地瓜",
                "pic": "/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"羞答答的玫瑰静悄悄地开！<br/>去年，无人驾驶搞得如火如荼，全球市值第二高的科技巨头谷歌却一副“性冷淡”的模样！直到今天，一切揭晓时，大家才知道，原来，谷歌一直在闷声大发财，悄悄地在背后不吭声地发力！刚刚，谷歌正式宣布：将在今年（2018年）商业化其无人驾驶出租车业务。<br/>怎么个商业化？谷歌说得很明白：2018年再次生产数千辆自动驾驶汽车，投入到出租车运营中去。<br/>这个数千究竟是几千，谷歌也没有说清楚。但按常规推算，起码3000辆以上。<br/>去年11月，谷歌投入的试运营车辆是500辆，不到三个月时间，又增加了数倍；按照这个速度，一旦这3000辆试运营的效果OK，将很快增加到“上万辆”、“数万辆”！<br/>一石激起千层浪！谷歌公布的这个信息，透露出了无限玄机：<br/><br/><img src='/webapp/m/hybrid/img/mortgage/1517986244.jpg'width='100%' height='100%'/><br/> 谷歌已经突破了技术屏障。谷歌能够有那么多无人驾驶车上路，说明已达谷歌无人驾驶，已经到了实际运用阶段了。而这密密麻麻的无人驾驶出租车上路，也将给谷歌提供大量的数据反馈，让其技术迅速改进。谷歌很快也将突破法律屏障。人类司机大约每行驶1—2亿英里的概率里会撞死一个人，因此，业界认为自动驾驶系统测试里程需要到2亿英里，才能证明其安全性。现在，谷歌这个数量级的车队上路，要通过这种“人肉测试”，将是分分钟的事。这也就是说，谷歌在今年商业化无人驾驶出租车业务，的确不是它在吹法螺；大批量商用的谷歌自动驾驶出租车，真的是很快要来了。<br/>措手不及！沉默已久的谷歌，今天终于憋出了大招，开始了绝地反击！<br/>这将是一场刺刀见血的厮杀！<br/>今天，最焦虑的，当数百度、华为和滴滴了。<br/>对于百度、华为这两家能在无人驾驶技术方面，堪与谷歌PK的中国公司来说，他们估计得经历一段“苦难行军”了。无人驾驶领域，将是一个“头部通吃”的领域。他们必须走得更快，干得更拼命，才能抢在谷歌之前，占据有利地形，组织有效反攻。今夜，滴滴或也将彻夜难眠，他们即将迎来生死时速。拥有无人驾驶技术的谷歌，将在打车、分时租赁、租赁等各个维度强势进入。想想吧，有了不知疲惫、无限供应机器人司机，滴滴这些公司，还怎么玩？写到这里不禁感慨：这真是一个充满不确定性的时代。<br/>随着技术和新产品更新迭代的几块，当今世界上的任何企业，都是面临一个危机四伏的世界，没有谁可以一劳永逸地活下去，没有谁离死亡不是一步之遥而已。<br/>如果说以前时代里的企业竞争，只是平面二维的、同行业之间的竞争，这个时代的企业竞争，则是三维、四维乃至更高维度的跨界竞争！<br/>降维打击是无比暴力也无比血腥的，它将让很多如日中天的企业，分秒之间突然陨落，上演高台跳水的悲剧，无可奈何花落去！<br/>向前一步是幸福，退后一步是黄昏，关键处行差还是走对，靠的，就是中国企业家的战略思考和把握。<br/>祝福中国企业家们！<br/>"
            },
            {
                "id":2,
                "p_name":"王**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"大家都知道考驾照需要通过规定驾驶培训学时才能报考其他科目考试，但有些不法分子为了牟利篡改驾驶培训学时案件，最近被法院提出公诉，据报道称，江苏省宜兴市检察院近日依法以涉嫌提供非法控制计算机信息系统的程序、工具罪，对篡改驾驶培训学时案件的34名被告人提起公诉。   <br/><br/>据介绍，犯罪嫌疑人林某、卢某从2015年11月至2017年7月，招募多名员工，共同完成跑码机、电子围栏破解芯片、免指纹芯片、图片机等四类用于非法控制计算机信息系统的程序、工具的生产、销售工作。截至案发，犯罪团伙非法获利达1597万元。<br/><br/>据了解，上述程序、工具可通过植入的方式控制汽车驾校教练车上的车载无线终端，使车载无线终端上传错误的学时数据、GPS数据、车辆跑码数据等，以此帮助各地的驾驶学员减少培训时间，提前非法获得驾驶员考试资格。"
            },
            {
                "id":3,
                "p_name":"赵**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"前两场比赛下来积分垫底，在李晓东看来也是意料之中的事，“重要的是我来了，又开始唱歌了。”近日播出的《歌手》第三期，李晓东是返场歌手，没有竞演压力的他演唱了一首《心的祈祷》。即便要暂时告别这个舞台，他仍满怀热情，之前还发微博与网友约定“突围赛不见不散”。<br/>在今年《歌手》的舞台上，李晓东不是知名度最高的一个，甚至很多人此前都没有听过他的名字，但是凭借《后来》《消愁》两首歌，很多人记住了他的声音。上世纪80年代出道的李晓东，90年代时成为《校园民谣2》中的主力歌手，当时他的代表作品有《冬季校园》《关于理想的课堂作文》等。在和唱片公司约满之后，他曾在酒吧担任过驻唱，2004年转型幕后。<br/>虽然认为自己并不是一个“纯粹的民谣歌手但李晓东身上依旧带有鲜明的民谣气质，人生经历起起伏伏，在他看来，“哀怨”情绪也只不过是一瞬间的事，“我不是那种总想着为什么自己不红了的性格。我也不是有输赢心的人，打牌、下棋这种游戏我都很少玩。”李晓东说，他只是单纯喜欢着唱歌这件事。前两场比赛下来积分垫底，在李晓东看来也是意料之中的事，“重要的是我来了，又开始唱歌了。”<br/>在上周《歌手》第二场中，李晓东一身牛仔衣裤亮相，带着沧桑感演唱了一首毛不易的歌曲《消愁》。李晓东坦言，自己想在《歌手》舞台用这首歌致敬人生，因为歌里的每一句词都能让他对照到自己：“我对自己没有特多的总结和规划，挺随遇而安的。但是突然间有这么一首歌的歌词把我总结出来了，吓我一跳，所以觉得和这首歌特别有缘分。”<br/>“没人记得你的模样，三巡酒过你在角落，固执的唱着苦涩的歌，听他在喧嚣里被淹没”。在毛不易这首《消愁》中，同样唱着李晓东的故事。<br/><br/>很早的时候李晓东就听过这首歌，他跟当时《明日之子》的音乐总监是多年的朋友，比赛的时候，李晓东一听《消愁》，只有一个想法：天才出来了，“这歌肯定会红，结果人家（毛不易）拿了冠军。”后来李晓东在参加《歌手》的两次试音中，都唱了这首歌。“‘一杯敬自由，一杯敬死亡’，这十个字表达的意境所有的大师都可以描述出来，但能提炼出来这几个字太不容易了。”在李晓东看来，自由和死亡是人生必须面对的，“用敬酒的方式来表达，是契合我性格的。我爱喝酒，天天敬来敬去，也没想过要敬自由、敬死亡。”<br/>李晓东感叹着，毛不易23岁就写出来了《消愁》这首好歌，自己恐怕到83岁也写不出来。和曾经做幕后的职业经历相关，李晓东对于有才华的年轻人总是特别偏爱，“我俩都是生活中话不多的人，但他比我还腼腆。”<br/><br/>李晓东说，自己今年48岁了，人生起起伏伏，对《消愁》肯定有自己的理解，但他没想明白的是，毛不易是哪里来的这些感悟，“我想他再怎么样也不可能吃过什么苦，他的简历也就是正常的上学、上班。我问他怎么写的，我以为是他喝了酒想起什么事。他说就是比赛的时候老师说要新歌，他就写了。我就更崩溃了，他随时都能写。”尽管《消愁》和《后来》两首歌让很多人迅速喜欢上了李晓东的歌声，但前两场比赛下来，李晓东积分垫底。对此，李晓东说，他有心理准备，“我一直在做幕后，对自己两场下来的表现和结果是有理性分析的。我们这几个人，怎么算我垫底都是正常的，从知名度上看，没有什么人知道我。别说现场只有五百人，五万人也会是我垫底。”关于李晓东西直门桥底下唱歌，被发掘时光倒退三十年，那个时候，李晓东是红极一时的歌手。李晓东出道的故事相当“老套”，相当于在西门町路上逛街时被星探发现的林青霞。上个世纪80年代末，人们平时没有什么业余活动，吃完饭要不就家里看电视，要不就大街上遛弯。那个时候开始有了吉他和流行歌曲，像李晓东那个年龄的孩子，十六七岁的男孩就喜欢几个人晚上路边一起弹吉他唱歌，叼个小烟圈，是当时少年最酷的配置。李晓东就是这样，和小伙伴们一起在西直门桥下唱歌时，被星探发现了。《星座》<br/><br/>“其实那个人来听过好多次我们唱歌了。他后来又专门听了听我的歌，说不错可以给你录磁带。那个时候‘录磁带’这事儿，听起来多洋气！”就这样，李晓东出了第一盘专辑《星座》，一夜之间就火了。此后《星座》系列连续出到《星座3》，从未有过专业音乐背景的李晓东还专门请了音乐老师补习了一两年。1994年，签约大地唱片公司。艺人供图<br/><br/>1994年，李晓东正式签约香港大地唱片公司，大地也是当时最好的唱片公司。同年，大地发行了《校园民谣2》，在当时并不算“校园歌手”的李晓东成为了专辑《校园民谣2》的主角，演唱了高晓松、郁冬和沈庆三人的作品，造就了《冬季校园》《关于理想的课堂作文》《没有想法》《老屋》等校园民谣代表歌曲。<br/>《给我你的爱》<br/>《校园民谣2》<br/><br/>李晓东和大地的合约签了三年，三年后，公司没有续约。“那个时候我才二十几岁，稀里糊涂的，也没有想过利用资源自己再接着做下去。”<br/>在大地期间，无论是演唱会、演出，还是媒体采访，都是直接跟公司对接。约满后，很快演出就不再有了。“而且还不是逐渐减少，是一下子就没有了。歌手没演出就只剩下待着了。”<br/>李晓东闲了大半年。<br/>1998年4月，“男孩女孩”酒吧的老板找到李晓东，“他（酒吧老板）之前做电台节目，跟我也认识。后来他想做酒吧现场演出，找我帮他组乐队。”上世纪90年代末，市面上流行的夜间娱乐场所还是夜总会，酒吧听起来时尚而高端，也没有哪个酒吧搞演出，这让李晓东觉得新鲜而有趣。<br/>“他也没想到我能答应，因为那个时候觉得签约歌手地位还挺高的。我那时已经闲待了大半年，还挺慌的，也没攒钱，需要赚钱。人家钱也给的挺好，又能玩乐队，多好。” 艺人供图李晓东说，做事“好玩”对他是一个很重要的条件，而且他对“签约歌手唱酒吧”这事，一点不介意。“我之前就听田震说过，在伦敦酒吧喝酒，一回头sting在后面唱歌呢。”这也让李晓东觉得，在酒吧唱歌神秘又浪漫。<br/>李晓东组建的乐队在酒吧一唱就火了。李晓东说，酒吧的舞台跟观众很近，人多的时候从舞台走到门口却需要十分钟，“你想想那得多少人。”那段时光很欢乐，每天半夜十二点半演出结束，大家一起去簋街喝酒。<br/>那个时候去酒吧的人大多是白领，当时在人均每个月几百块工资的情况下，酒吧里啤酒四十多一瓶，算是相当高端的消费场所。有客人每天都来，而且每天都是同一个时间来，一来来两年，直到有一天突然再也不出现了，这些场景听起来都像老电影中的画面。李晓东笑着回忆，每天来酒吧的客人中有各种大老板，总喜欢点同一首歌听，比如beyond的《不再犹豫》，“每天就要听这一首歌，然后全场大合唱。”李晓东自己喜欢唱的都是老歌，李寿全的《张三的歌》、刘文正的《雨中即景》、潘安邦的《恰似你的温柔》，非常受欢迎。因为酒吧生意好，后来陆续在青岛、深圳都开了分店，还成立了“男孩女孩”音乐公司，其中各种琐事李晓东都得管。复出原因 想让儿子过的更好这些年，李晓东的日子像一个普通上班族一样稳定、平凡。平时做一些音乐的幕后工作，辅导一下年轻人，更多的时间回归家庭。<br/>李晓东在他47岁时有了儿子，此次决定从幕后走到台前，他坦言也有部分原因是为了儿子，“如果我上这个节目让大家都知道，又让很多观众重新回忆起了过去，有了一些知名度，带来一些演出，我也可以多赚一点钱补贴家用，对儿子今后的生活、教育各方面应该都能起到好的作用。”<br/>李晓东和儿子。图片来自艺人微博<br/><br/>儿子如今14个月大，还看不懂电视节目，看到《歌手》中的李晓东，对他来说跟和爸爸通视频没有什么区别。这个时候儿子就会向平时视频通话一样，跟电视里的李晓东招手。<br/>提到儿子，李晓东眼睛里都是笑，“哎，就是现在忙起来没时间陪儿子了。过了这一阵子应该好一点。”李晓东说，如果能再重新站在台上唱歌，收入跟目前比肯定是不一样的，“大舞台上唱歌赚钱多一点，孩子生活条件、教育条件都好一点。我有时候想，他上大学我都70岁了，我还能为他做些什么呢？”  <br/>回忆起自己出道这三十年的起落，出过唱片、唱过酒吧，也开过班传授声乐技巧、给其他歌手做过音乐总监，反反复复中他发现，自己最喜欢做的事情还是唱歌。“如果可以被更多人接受，当然希望一直唱歌。我真的非常想唱歌，也喜欢唱歌，这是我活了快五十年可以做到的最好的一件事。”"
            },
            {
                "id":4,
                "p_name":"当**",
                "pic":"/webapp/m/hybrid/img/mortgage/9473266b1142e651!400x400_big.jpg",
                "content":"*ST华泽的股价已经沉睡了将近两年，但在场外，这家上市公司屡屡上镜。<br/>2月6日，证监会在公布了2018年1号《中国证监会市场禁入决定书》（下称《禁入决定书》），对华泽钴镍在2013-2015年关联交易及年报造假等行为做出处罚，公司时任董事长王涛被采取终身证券市场禁入措施。<br/>这不是*ST华泽首次成为焦点。国信证券因华泽钴镍重组案被查、基金下调股票估值至61个跌停、费用不足公司网站被关、账上仅余178元，内外交困的华泽被网友称为“最穷上市公司”。<br/>父子操纵关联交易 99%应收票据无效<br/> <br/><img src='/webapp/m/hybrid/img/mortgage/1517986026(1).jpg'width='100%' height='100%'/><br/> 证监会表示，华泽钴镍在2013年至2015年，通过全资控股企业陕西华泽，与星王集团等关联法人进行关联交易，并向其提供资金。2015年财报显示，公司实际控制人通过名下陕西星王企业集团有限公司违规占用*ST华泽14.97亿元。<br/>为掩盖关联方长期占用资金的事实，华泽钴镍时任董事长王涛安排人员搜集票据复印件，将无效票据入账充当还款，导致2013年、2014年年报以及2015年半年报中均存在虚假记载。据证监会披露的数据，在上述每个报告期，华泽钴镍均存在超过10亿元的无效票据，超过当期应收票据期末余额的99%。此外，华泽钴镍还存在未及时披露担保事项等问题。<br/>《禁入决定书》称，王涛在担任华泽钴镍董事长期间同时担任星王集团经理。而值得注意的是，王涛的父亲王应虎则在彼时兼任华泽钴镍副董事长和星王集团的法定代表人。<br/>2016年3月，王涛被证监会调查。两个月后，华泽钴镍发布公告，王涛因“个人原因”辞去公司董事长职务，董事长职务由王应虎代行。<br/>除对王涛采取终身市场禁入之外，证监会对王应虎也处以10年证券市场禁入。2月1日，华泽镍钴发布公告称，截至调查结束，仍有3亿票据尚未收回，由于担保事项等违规行为给公司带来或有负债的情形尚未消除。<br/>AI财经社此前发现，华泽的官网（www.hznc.com.cn）也无法访问，*ST华泽通过互动易平台回应称：公司网址因欠费暂停。<br/>上例终身禁入在去年底<br/><br/><img src='/webapp/m/hybrid/img/mortgage/1517985988(1).jpg'width='100%' height='100%'/><br/> 据《信息时报》报道，2017年共有10人被处以终身禁入市场，罚单数量、金额也远超往年。<br/>上一次终身禁入发生在2017年12月，江苏雅百特科技股份有限公司时任董事长陆永因公司虚构海外工程项目、虚构建材出口贸易、虚构国内建材贸易等方式虚增收入，被证监会采取终身市场禁入措施。<br/>此外，勤上光电在1月15日公告称，收到证监会《行政处罚及市场禁入事先告知书》，指勤上股份未按规定及时披露信息并存在虚假记载。证监会表示，公司实际控制人李旭亮对此负有重大责任，并曾两次被证监会行政处罚，拟决定对其采取终身证券市场禁入措施。<br/>"
            },{
                "id":5,
                "p_name":"田**",
                "pic":"/webapp/m/hybrid/img/mortgage/315071ae1451c4f2!400x400_big.jpg",
                "content":"随着房地产由售转租，大城市人口逐渐趋于稳定，商品房逐渐由新房市场为主转变为以二手房市场为主。2017 年，北京、上海、广州、深圳的二手房交易量分别达到新房的3.3 倍、1.1 倍、1.7 倍和2.7 倍。而整个2017年，有超过24个城市二手房成交量超过新房，部分三线城市也加入这个行列，比如常州、中山、扬州、绍兴、三明等城市。在二手房市场中，房产中介是绝对绕不开的话题，他们掌控了交易渠道，帮助购房者挑选房屋，帮助房主找到合适的购房者。<br/>百客君要说的是，房产中介并不是希望把房价炒高，他们的目的是尽可能促成多的交易，他们的收入主要来自于佣金。所以为了促成二手房交易，他们会带购房者看很多的房子，每天打很多的电话确认买家和卖家的需求，在看房、谈判和成交等阶段，中介要掌握进度，通过一系列手法促成交易。这是一般房产中介的工作流程。作为购房者，你从跟着房产中介看房开始，就已经进入房产中介的“节奏”了。<br/>一、带看环节，房产中介常见的手法<br/>1、你去中介门店看房，中介为了留住你，一般会抛出一套“价格特别合适”的房源，临看房的时候，可能会出现一些意想不到的状况，比如中介到跟前儿才会告诉你，这套房是已购公房、经适房、不满两年的商品房等等，房子便宜，但交易成本高。又或者临时接个电话，然后就说房子已经售出等等。<br/>通过这种手法，中介可以转而推荐他想尽快卖出去的房子。<br/>2、中介带看房，是有讲究的，比如他带你看三套房，会将最符合你需求的房子留在最后。第一套房会让你感觉一般，第二套房会更差，第三套房最好，有了落差，才能加强你的购房欲望，以促成交易。中介不会带你看很多套房，看多了，心累疲乏，反而不容易促成交易。<br/>3、带看过程中还会营造房源很抢手的气氛，比如找其他中介小哥帮忙配合，你在看房的过程中，其他中介也带人来看房，而且专门挑你最中意的房子看。<br/>4、当你看完所有房源，觉得有一套特别中意的时候，中介还会带你发掘这套房的更多优点，比如周边的各种成熟配套。<br/>二、房子看完了，还有个更重要的环节，那就是“逼定”<br/>“逼定”是销售行业的术语，具体到房地产环节，他们“逼定”的手法包括但不限于以下这些：<br/>1、当你看上了某套房但报价与房主挂牌价差距较大时，中介往往直接否定，给出的理由通常是最近成交的类似房源，成交价都比你出的价格高，目的是让你出更高的价格。<br/>2、如果你出的价格与房主挂牌价比较吻合，这时候中介要做的就是尽快锁定交易，催促你交订金。<br/>催促你交定金的方式也有很多，玩心理战的比较多。比如某套房有很多人都盯着，中介会说“有看房客户要求中介不要再带人来看房了”“XX房子性价比很高，有看房客户已经在和业主谈了”，谁先交定金，谁就能拿下房子。<br/><br/>二手房交易过程中，最大的弊端就是信息壁垒，购房者和房主直接沟通成本很高。中介通过建立这个信息壁垒优势来确保自己的利益。不能说中介一定会把差的房子卖给购房者，已达到什么目的。但知道这些二手房中介的手法，买二手房也会买得更安全更踏实。"
            }
        ];
        var pas=parseInt($scope.pageId);
        var ts=$scope.pageTwoList[pas].content;
        $("#artitle2").html(ts);
    }
]);
//首页图片轮播
app.directive("slideBox",["$rootScope","$http",function($rootScope, $http){
    return {
        restrict: 'AE',
        template: '<div class="bd"><ul></ul></div><div class="hd"><ul></ul></div>',
        link: function(scope, iElement, iAttrs){
            var watchbanners = scope.$watch("banners",function(newVal,oldVal){
                if(newVal != undefined && newVal.length > 1 ){
                    //轮播图
                    var imgList = scope.banners;
                    var liList = "";
                    for(var i=0;i<imgList.length;i++){
                        liList += '<li id="'+imgList[i].id+'"><img src="'+imgList[i].imgurl+'" type="'+imgList[i].type+'" id="'+imgList[i].adid+'" title="'+imgList[i].title+'"></li>';
                    }
                    $(iElement).find("ul").html(liList);
                    TouchSlide({
                        slideCell:"#" + iAttrs.id,
                        titCell:".hd ul", //开启自动分页 autoPage:true ，此时设置 titCell 为导航元素包裹层
                        mainCell:".bd ul",
                        effect:"leftLoop",
                        interTime: 5000,//自动运行间隔
                        delayTime: 1000,//切换效果持续时间
                        autoPage:true,//自动分页
                        autoPlay:true //自动播放
                    });
                    //释放监听
                    watchbanners();
                }else if(newVal != undefined && newVal.length == 1){
                    //轮播图
                    var imgList = scope.banners;
                    var liList = "";
                    for(var i=0;i<imgList.length;i++){
                        liList += '<li id="'+imgList[i].id+'"><img src="'+imgList[i].imgurl+'" type="'+imgList[i].type+'" id="'+imgList[i].adid+'" title="'+imgList[i].title+'"></li>';
                    }
                    $(iElement).find("ul").html(liList);
                    TouchSlide({
                        slideCell:"#" + iAttrs.id,
                        titCell:".hd ul", //开启自动分页 autoPage:true ，此时设置 titCell 为导航元素包裹层
                        mainCell:".bd ul",
                        effect:"leftLoop",
                        autoPage:true,//自动分页
                        autoPlay:false //自动播放
                    });
                    //释放监听
                    watchbanners();
                }
            })
        }
    }
}]);
/**-房屋抵押-**/
app.controller('mortgageController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>{{homeMort.title}}</div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //房屋抵押url
    var homeUrl = $rootScope.URL_ROOTS + "/product/house";
    //第一页
    $scope.onePage=1;
    setTimeout(
        function () {
            $http.get(homeUrl+"?page="+$scope.onePage).success(
                function (response) {
                    $('body').css("overflow", "hidden");
                    $scope.loading =true;
                    if(response.status=='200'){
                        $('body').css("overflow", "auto");
                        $scope.homeMort=response.data;
                        //房抵贷数据列表
                        $scope.mortList=response.data.list;
                        //总页数
                        $scope.page_num=response.data.last_page;
                        $scope.loading = false;
                        $(".loads").hide();
                        if(response.data.list.length=="0"){
                            $('.more i').removeClass('pull_icon flip loading');
                            $('.more span').text('暂无数据');
                        }
                        if(response.data.last_page=='1'){
                            $('.more i').removeClass('pull_icon flip loading');
                            $('.more span').text('无加载数据');

                        }
                    }
                });
        },1000
    );
    $(window).scroll(function () {
        if ($(document).scrollTop() + $(window).height() == $(document).height()) {
            $scope.loadMore = function() {
                if($scope.onePage<=$scope.page_num){
                    $('.pull_icon').addClass('loading');
                    $('.more span').text('加载中');
                    $scope.onePage=$scope.onePage+1;
                    $http.get(homeUrl+"?version=2.0&source=webapp&page="+$scope.onePage).success(function(response){
                        if(response.status=="200"){
                            //房抵贷数据列表内容
                            $scope.mortList=$scope.mortList.concat(response.data.list);
                            if(response.data.list.length=='0'){
                                $('.more i').removeClass('pull_icon flip loading');
                                $('.more span').text('无加载数据');

                            }
                        }
                    });
                }else{
                    return false;
                }
            }
        }
    });
    //封装传递给安卓和IOS
    $scope.loadURL = function (url) {
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    };
    //点击跳转贷款详情
    $scope.mortgage=function ($index) {
		var shareUrl=window.location.href;
        $scope.libiao={};
        $scope.libiao.details_id=$index.id;
        $scope.libiao.p_name=$index.p_name;
        $scope.libiao.pic=$index.pic;
        $scope.contentPamar={"title":"抵押贷详情","content":$scope.libiao,"titleIcon":$scope.libiao.p_name+"房抵贷，在线申请免服务费","imgUrl":$scope.libiao.pic,"contentIcon":"拒绝猫腻，全程透明，更提供快速解压。点击查看额度","Url":shareUrl};
        $scope.listData=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://lbClick?"+$scope.listData);
    }
    //帮我选贷
    $scope.mortHomeClick=function () {
        $scope.loadURL("BKDACTION://houseLinkClick?");
    }
}]);
/**-信用贷-**/
app.controller('cdsController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>信用贷</div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".help_top").removeClass("mrt-55");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".help_top").addClass("mrt-55");
    }
    $scope.loading =true;
    $scope.pullIcon=true;
    $scope.pullMessage="上拉加载";
    //第一页
    $scope.cdsPage=1;
    //信用贷url
    var cdsUrl = $rootScope.URL_ROOTS + "/product/bank";
    setTimeout(
        function () {
            $http.get(cdsUrl+"?page="+$scope.cdsPage).success(
                function (response) {
                    $('body').css("overflow", "hidden");
                    $scope.loading =true;
                    if(response.status=='200'){
                        $('body').css("overflow", "auto");
                        $scope.cdsMort=response.data;
                        //信用贷数据列表
                        $scope.cdsList=response.data.list;
                        //总页数
                        $scope.pag_num=response.data.last_page;
                        $scope.loading = false;
                        $(".loads").hide();
                        if(response.data.list.length==0||response.data.list.length<10){
                            $scope.pullIcon=false;
                            $('.more i').removeClass('pull_icon flip loading');
                            $scope.pullMessage="暂无数据";
                        }
                        if(response.data.last_page=='1'){
                            $scope.pullIcon=false;
                            $('.more i').removeClass('pull_icon flip loading');
                            $scope.pullMessage="无加载数据";

                        }
                    }
                });
        },1000
    );
    $(window).scroll(function () {
        if ($(document).scrollTop() + $(window).height() == $(document).height()){
            $scope.loadMore = function() {
                if($scope.cdsPage<=$scope.pag_num){
                    $('.pull_icon').addClass('loading');
                    $scope.pullMessage="加载中";
                    $scope.cdsPage=$scope.cdsPage+1;
                    $scope.speedPage=$scope.speedPage+1;
                    $http.get(cdsUrl+"?page="+$scope.cdsPage).success(
                        function(response){
                            if(response.status=="200"){
                                //信用贷数据列表
                                $scope.cdsList=$scope.cdsList.concat(response.data.list);
                                if(response.data.list.length=='0'){
                                    $('.more i').removeClass('pull_icon flip loading');
                                    $scope.pullMessage="无加载数据";
                                }
                            }
                        });
                }else{
                    return false;
                }
            }
        }
    });
    //点击银行贷详情
    $scope.cdsOneClick=function ($index) {
        //封装传递给安卓和IOS
        $scope.loadURL = function (url) {
            var iFrame;
            iFrame = document.createElement("iframe");
            iFrame.setAttribute("src", url);
            iFrame.setAttribute("style", "display:none;");
            iFrame.setAttribute("height", "0px");
            iFrame.setAttribute("width", "0px");
            iFrame.setAttribute("frameborder", "0");
            document.body.appendChild(iFrame);
            // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
            iFrame.parentNode.removeChild(iFrame);
            iFrame = null;
        };
       var shareUrl=window.location.href;
        $scope.bankAll={};
        $scope.bankAll.bank_id=$index.id;
        $scope.bankAll.p_name=$index.p_name;
        $scope.bankAll.pic=$index.pic;
        $scope.contentPamar={"title":"银行贷详情","content":$scope.bankAll,"titleIcon":$scope.bankAll.p_name+"信用贷，快速申请通道","imgUrl":$scope.bankAll.pic,"contentIcon":"无抵押，无担保，无中间费用，最快1天放款。点击查看额度","Url":shareUrl};
        $scope.listData=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://bankClick?"+$scope.listData);
    }
}]);
/**-评论-**/
/*app.controller('reviewController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
	
	 var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' ng-click='backHomeClick();'>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>评论</div>" +
        "</div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //评论url
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
 
}]);*/
/**-评论列表-**/
app.controller('reviewController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
	
	 var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>评论</div>" +
        "</div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //评论列表url
    var processUrl = $rootScope.URL_ROOTS + "/product/comment";
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    $scope.reviewId=GetQueryString("p_id");
	$scope.myDate= new Date();
	//第一页
    $("textarea[name='d1']").val("");
    //评分
    $scope.load=function(){
        var s = document.getElementById("pingStar");
        n = s.getElementsByTagName("li"),
        input = document.getElementById("startP");//保存所选值
        clearAll = function(){
            for(var i = 0;i < n.length;i++){
                n[i].className = "";
            }
        }
        for(var i = 0;i < n.length;i++){
            n[i].onclick = function(){
                var q = this.getAttribute("rel");
                clearAll();
                input.value = q;
                $scope.qNumer=q;
                if(!isEmpty($scope.qNumer)){
                    $(".text-ms").hide();
                }
                for(var i = 0;i < q;i++){
                    n[i].className = "on";
                }
            }
            n[i].onmouseover = function(){
                var q = this.getAttribute("rel");
                clearAll();
                for(var i = 0;i < q;i++){
                    n[i].className = "on";
                }
            }
            n[i].onmouseout = function(){
                clearAll();
                for(var i = 0;i < input.value;i++){
                    n[i].className = "on";
                }

            }
        }
    }
    //评论url
    var discussUrl=$rootScope.URL_ROOTS + "/product/add_comment";
    //判断输入的字数是否是15个以上
    $scope.myKey=function () {
        var textArea=$("textarea[name='d1']").val();//文本区域内容
        $scope.tArea=$.trim(textArea);//去掉文本内容第一个和最后一个的空格字符
        if($scope.tArea.length<=15){
            $scope.discussMessage="评论不能少于15字";
        }else{
            $scope.discussMessage="";
        }
    }
    $scope.discussClick=function () {
        $scope.discuss={};//初始化
        $scope.discuss.rate=$scope.qNumer;
        $scope.discuss.product_id=GetQueryString("product_id");//产品id
        $scope.discuss.order_id=GetQueryString("order_id");//订单id
        $scope.sessionToken=GetQueryString("token");
        sessionStorage.setItem("session",$scope.sessionToken);
        $scope.discuss.content=$scope.tArea;
        if(isEmpty($scope.discuss.rate)){
            $scope.discussMessage="请选择评分";
            return false;
        }
        if(isEmpty($scope.discuss.content)){
            $scope.discussMessage="请填写评论";
			$(".text-ms").show();
            return false;
        }
        $http.post(discussUrl,$scope.discuss).success(
            function (response) {
                $(".loads").show();
                if(response.status=="801"){
                    $scope.discussMessage=response.message;
                    $(".text-ms").show();
                    $(".loads").hide();
                    return false;
                }
                if(response.status="200"){
                    $(".loads").hide();
					    $scope.loadURL=function(url){
						var iFrame;
						iFrame = document.createElement("iframe");
						iFrame.setAttribute("src", url);
						iFrame.setAttribute("style", "display:none;");
						iFrame.setAttribute("height", "0px");
						iFrame.setAttribute("width", "0px");
						iFrame.setAttribute("frameborder", "0");
						document.body.appendChild(iFrame);
						// 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
						iFrame.parentNode.removeChild(iFrame);
						iFrame = null;
					}
					$scope.loadURL("BKDACTION://mageClick?");
                    //window.location.href=$rootScope.ROOT+"mortgage/mortgage.html?date="+$scope.myDate;
                }
        });
    }
    /**返回上一页**/
    $scope.backHomeClick=function () {
        window.location.href=$rootScope.ROOT+"review/process.html?order_id="+GetQueryString("order_id")+"&date="+$scope.myDate;
    }
    //第一页
    $scope.proPage=1;
    setTimeout(
        function () {
            $http.get(processUrl+"?p_id="+$scope.reviewId+"&page="+$scope.proPage).success(
                function (response) {
                    $('body').css("overflow", "hidden");
                    $scope.loading =true;
                    if(response.status=='200'){
                        $('body').css("overflow", "auto");
                        $scope.proMort=response.data;
                        //评论数据列表
                        $scope.processList=response.data.list;
                        //总页数
                        $scope.pag_num=response.data.last_page;
                        $scope.loading = false;
                        $(".loads").hide();
                        if(response.data.list.length=="0"){
                            $('.more i').removeClass('pull_icon flip loading');
                            $('.more span').text('暂无数据');
                        }
                        if(response.data.last_page=='1'){
                            $('.more i').removeClass('pull_icon flip loading');
                            $('.more span').text('无加载数据');

                        }
                    }
                });
        },1000
    );
    $(window).scroll(function () {
        if ($(document).scrollTop() + $(window).height() == $(document).height()+1){
            $scope.loadMore = function() {
                if($scope.proPage<=$scope.pag_num){
                    $('.pull_icon').addClass('loading');
                    $('.more span').text('加载中');
                    $scope.proPage=$scope.proPage+1;
                    $http.get(processUrl+"?page="+$scope.proPage).success(
                        function(response){
                            if(response.status=="200"){
                                //评论数据列表内容
                                $scope.processList=$scope.processList.concat(response.data.list);
                                if(response.data.list.length=='0'){
                                    $('.more i').removeClass('pull_icon flip loading');
                                    $('.more span').text('无加载数据');

                                }
                            }
                    });
                }else{
                    return false;
                }
            }
        }
    });
}]);
/**-申请流程-**/
app.controller('processController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
	 var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>{{rsTitle}}</div>" +
        "</div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-estimate").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-estimate").addClass("mrt-45");
    }
	    /**传递app数据**/
    $scope.loadURL=function(url){
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    }
	$scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    //申请流程url
    var prosUrl = $rootScope.URL_ROOTS + "/order/house/"+GetQueryString("order_id");
    //封装调取接口
    $scope.fund=function () {
        $scope.numOne=false;
        $scope.numTwo=false;
        $scope.numThree=false;
        $scope.numFour=false;
        $scope.numFive=false;
        $scope.numSix=false;
        $scope.numSeven=false;
        /**时间是否显示**/
        $scope.timeWrapOne=false;
        $scope.timeWrapTwo=false;
        $scope.timeWrapThree=false;
        $scope.timeWrapFour=false;
        $scope.timeWrapFive=false;
        $scope.timeWrapSix=false;
        $scope.sessionToken=GetQueryString("token");
        sessionStorage.setItem("session",$scope.sessionToken);
        $http.get(prosUrl).success(function (response) {
            $scope.rsTitle=response.data.title;//申请流程的title
            $scope.rsList=response.data.order_info;//申请流程数据
            $scope.timeline=response.data.order_info.time_line;//判断状态和时间
            $scope.is_comment=response.data.order_info.is_comment;//判断是否判断
            for(var i=0;i<$scope.timeline.length;i++){
                var n=$scope.timeline[i].order_state;
                switch(n)
                {
                    case 10:
                        $scope.numOne=true;
                        $scope.timeOne=$scope.timeline[i].log_time;
                        break;
                    case 20:
                        $scope.numTwo=true;
                        $scope.timeTwo=$scope.timeline[i].log_time;
                        break;
                    case 30:
                    case 31:
                    case 32:
                        $scope.numThree=true;
                        $scope.timeThree=$scope.timeline[i].log_time;
                        break;
                    case 40:
                        $scope.timeFour=$scope.timeline[i].log_time;
                        $scope.numFour=true;
                        break;
                    case 50:
                    case 51:
                    case 52:
                        $scope.timeFive=$scope.timeline[i].log_time;
                        $scope.numFive=true;
                        break;
                    case 60:
                        $scope.timeSix=$scope.timeline[i].log_time;
                        $scope.numSix=true;
                        break;
                    case 90:
                        $scope.timeSeven=$scope.timeline[i].log_time;
                        $scope.numSeven=true;
                        break;
                    default:
                        break;
                }
            }
            if($scope.rsList.order_status==10){
                $scope.loadMsg="请上传资质资料";
                $scope.dspMsg="";
                $scope.deposit="未支付定金";
                $scope.refund="";
                $scope.audit="未评估审核";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.timeWrapOne=false;
                return false;
            }
            if($scope.rsList.order_status==20){
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="未支付定金";
                $scope.refund="";
                $scope.audit="未评估审核";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.timeWrapOne=true;
                return false;
            }
            if($scope.rsList.order_status==30){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.audit="未评估审核";
                $scope.deposit="已支付定金";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.refund="申请退款";
                return false;
            }
            if($scope.rsList.order_status==31){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.audit="未评估审核";
                $scope.deposit="已支付定金";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.refund="退款中";
                return false;
            }
            if($scope.rsList.order_status==32){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.audit="未评估审核";
                $scope.deposit="已支付定金";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.refund="退款完成";
                return false;
            }
            if($scope.rsList.order_status==40){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.refund="申请退款";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="未支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                return false;
            }
            if($scope.rsList.order_status==50){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.refund="申请退款";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.reimburse="申请退款";
                $(".rem0").hide();
                return false;
            }
            if($scope.rsList.order_status==51){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.refund="退款中";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                $scope.reimburse="退款中";
                $(".rem0").hide();
                return false;
            }
            if($scope.rsList.order_status==52){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.refund="退款完成";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="未抵押";
                $scope.facility="未贷款";
                return false;
            }

            if($scope.rsList.order_status==60){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.timeWrapFive=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="抵押完成";
                $scope.facility="未贷款";
                $(".rem0").hide();
                $(".rem1").hide();
                return false;
            }
            if($scope.rsList.order_status==70){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.timeWrapFive=true;
                $scope.timeWrapSix=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="抵押完成";
                $scope.facility="已确认贷款";
                $(".rem0").hide();
                $(".rem1").hide();
                return false;
            }
            if($scope.rsList.order_status==80){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.timeWrapFive=true;
                $scope.timeWrapSix=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                if($scope.timeline[i].order_state==32){
                    $scope.deposit="已支付定金";
                    $scope.refund="退款完成";
                    $scope.audit="未评估审核";
                    $scope.valuationFee="未支付评估费";
                    $scope.pledgeMsg="未抵押";
                    $scope.facility="未贷款";
                    $scope.reimburse="";
                }
                if($scope.timeline[i].order_state==52){
                    $scope.audit="评估审核已完成";
                    $scope.refund="退款完成";
                    $scope.deposit="已支付定金";
                    $scope.valuationFee="已支付评估费";
                    $scope.pledgeMsg="未抵押";
                    $scope.facility="未贷款";
                    $scope.reimburse="退款完成";
                }
                return false;
            }
            if($scope.rsList.order_status==90){
                $scope.timeWrapOne=true;
                $scope.timeWrapTwo=true;
                $scope.timeWrapThree=true;
                $scope.timeWrapFour=true;
                $scope.timeWrapFive=true;
                $scope.timeWrapSix=true;
                $scope.loadMsg="已经上传资质材料";
                $scope.dspMsg="查看上传信息";
                $scope.deposit="已支付定金";
                $scope.audit="评估审核已完成";
                $scope.valuationFee="已支付评估费";
                $scope.pledgeMsg="抵押完成";
                $scope.facility="已确认贷款";
                $(".rem0").hide();
                $(".rem1").hide();
            }
        });
    }
    $scope.fund();
    /**上传资料**/
    $scope.upload=function () {
        $scope.uploadAll={};
        $scope.uploadAll.orderid=$scope.orderId;
        $scope.contentPamar={"title":"申请流程","content":$scope.uploadAll};
        $scope.orderMore=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://uploadClick?"+$scope.orderMore);
    }
    /**修改上传**/
    $scope.modifyUpload=function () {
        $scope.uploadAll={};
        $scope.uploadAll.orderid=$scope.orderId;
        $scope.contentPamar={"title":"申请流程","content":$scope.uploadAll};
        $scope.orderMore=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://uploadClick?"+$scope.orderMore);
    }
    /**支付定金**/
    $scope.depositPay=function () {
        window.location.href=$rootScope.ROOT+"pay/depositPayment.html?pay_id="+$scope.orderId+"&token="+$scope.sessionToken;
    }
    /**支付服务费**/
    $scope.payMent=function () {
        window.location.href=$rootScope.ROOT+"pay/payment.html?pay_id="+$scope.orderId+"&token="+$scope.sessionToken;
    }
    //加密结果
    $scope.refundClick=function ($rt) {
        var indentUrl=$rootScope.URL_ROOTS + "/order/change_status/";
        //初始化订单json
        $scope.indentData={};
        $scope.indentData.order_id=$rt.order_id;
        $scope.indentData.order_status=31;
        //RSA加密
        $rootScope.encrypt=encrypt;
        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
        encrypt.setPublicKey(public_key);
        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.indentData));
        //更改订单状态-退款或者完成
        $http({
            method: "POST",
            url: indentUrl,
            data: {
                parmater: $scope.enPram
            },
            headers: {
                'Content-Type': 'application/x-www-form-urlencoded',
                'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
            },
        }).success(function (response) {
            if(response.status=="200"){
                $scope.fund();
            }else{
                $scope.logMsg=response.message;
            }
        });
    }
    //第二个评估费退款
    $scope.refundOneClick=function ($rt) {
        var indentUrl=$rootScope.URL_ROOTS + "/order/change_status/";
        //初始化订单json
        $scope.indentData={};
        $scope.indentData.order_id=$rt.order_id;
        $scope.indentData.order_status=51;
        //RSA加密
        $rootScope.encrypt=encrypt;
        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
        encrypt.setPublicKey(public_key);
        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.indentData));
        //更改订单状态-退款或者完成
        $http({
            method: "POST",
            url: indentUrl,
            data: {
                parmater: $scope.enPram
            },
            headers: {
                'Content-Type': 'application/x-www-form-urlencoded',
                'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
            },
        }).success(function (response) {
            if(response.status=="200"){
                $scope.fund();
            }else{
                $scope.logMsg=response.message;
            }
        });
    }
    //完成确认订单
    $scope.submitLog=function ($rt) {
        var indentUrl=$rootScope.URL_ROOTS + "/order/change_status/";
        //初始化订单json
        $scope.indentData={};
        $scope.indentData.order_id=$rt.order_id;
        $scope.indentData.order_status=90;
        //RSA加密
        $rootScope.encrypt=encrypt;
        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
        encrypt.setPublicKey(public_key);
        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.indentData));
        //更改订单状态-退款或者完成
        $http({
            method: "POST",
            url: indentUrl,
            data: {
                parmater: $scope.enPram
            },
            headers: {
                'Content-Type': 'application/x-www-form-urlencoded',
                'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
            },
        }).success(function (response) {
            if(response.status=="200"){
                $scope.fund();
            }else{
                $scope.logMsg=response.message;
            }
        });
    }
    /**跳转到评估**/
    $scope.assessGo=function () {
        window.location.href=$rootScope.ROOT+"estimation/estimation.html";
    }
    //事件
    $scope.productHeader=function () {
		 if(isEmpty(GetQueryString("bankType"))){
            return false;
        }else{
			$scope.uploadAll={};
			$scope.uploadAll.details_id=$scope.rsList.product_id;
			$scope.contentPamar={"title":"详情","content":$scope.uploadAll};
			$scope.orderMore=JSON.stringify($scope.contentPamar);
			$scope.loadURL("BKDACTION://aboutClick?"+$scope.orderMore);
//window.location.href=$rootScope.ROOT+"details/details.html?details_id="++"&token="+$scope.sessionToken+"&historyBck=";
        }
    }
	$scope.myDate = new Date();
    $scope.orderId=GetQueryString("order_id");//orderId
    //跳转评价
    $scope.evaluate=function () {
        window.location.href=$rootScope.ROOT+"review/estimate.html?product_id="+$scope.rsList.product_id+"&order_id="+$scope.orderId+"&token="+GetQueryString("token")+"&date="+$scope.myDate;
    }
}]);
/**-房抵押详情-**/
app.controller('detailsController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>{{deatilsList.title}}</div>" +
        "<div class='details-share' ng-click='shareLoans();'><a>分享赚钱</a></div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //详情url
    var detailsUrl = $rootScope.URL_ROOTS + "/product/house/"+GetQueryString("details_id");
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    $scope.loading=true;
    $('body').css("overflow", "hidden");
    $scope.ensOne=false;
    $scope.ensTwo=false;
    $http.get(detailsUrl).success(
        function (response){
            if(response.status=="200"){
                $scope.loading=false;
                $('body').css("overflow", "auto");
                //贷款详情列表
                $scope.deatilsList=response.data;
				if(response.data.comment.length==0){
					$(".grade-review").hide();
				}
                $scope.remark=response.data.comment.latest;//用户点评
                $scope.remarkNums=response.data.comment.nums;//评论个数
                $scope.aboutList=response.data.product;
                if($scope.aboutList.is_collection==1){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                }else{
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                }
                //tab显示
                $scope.tabList=response.data.product.repayment_method;
                for(var i=0;i<$scope.tabList.length;i++){
                    var tabAll=[];
                    for(var j in $scope.tabList){
                        //tab的key
                        $scope.tabKey=(parseInt(j)+1).toString();
                        //tab的value
                        $scope.tabValue=$scope.tabList[j];
                        tabAll.push({
                            tabName:$scope.tabKey,
                            tabValue:$scope.tabValue
                        });
                    }
                }
                $scope.tabAll=tabAll;
                //选择框select
                $scope.selectList=response.data.product.stage;
                $scope.selectLen=$scope.selectList.split(',');
                var Months=[];
                for(var i=0;i<$scope.selectLen.length;i++){
                    $scope.lenStr=$scope.selectLen[i].replace("个月","");
                    Months.push({
                        days:$scope.selectLen[i],
                        number:$scope.lenStr,
                        numId:i
                    });
                }
                //期限列表
                $scope.monthsList=Months;
                //金额初始值
                $scope.labelMoney=($scope.aboutList.max_limit-$scope.aboutList.min_limit)/2+$scope.aboutList.min_limit;
                $scope.firstMonths=$scope.monthsList[0].number;//初始化月份
                $scope.moneyClick=function () {
                    //等额本息还款法
                    //每月月供额=〔贷款本金×月利率×(1＋月利率)＾还款月数〕÷〔(1＋月利率)＾还款月数-1〕
                    $scope.toMonthMoney=(($scope.labelMoney*10000*$scope.aboutList.min_rate/100*Math.pow((1+$scope.aboutList.min_rate/100),$scope.firstMonths))/(Math.pow((1+($scope.aboutList.min_rate/100)),$scope.firstMonths)-1)).toFixed(1);//每月月供额
                    $scope.instAll=($scope.firstMonths*$scope.toMonthMoney-$scope.labelMoney*10000).toFixed(1);//总利息
                    //等额本金还款法
                    var returnMoney="0";//已经归还的金额
                    for(var i=0;i<$scope.firstMonths;i++){
                        //第一个月月供额度
                        $scope.toMonthEqual=((($scope.labelMoney*10000)/$scope.firstMonths)+($scope.labelMoney*10000-returnMoney)*($scope.aboutList.min_rate/100)).toFixed(1)//每个月月供额度
                        returnMoney=+$scope.toMonthEqual;
                        $scope.decrease=($scope.labelMoney*10000/$scope.firstMonths)*($scope.aboutList.min_rate/100);//每个月递减多少
                        $scope.gross=((($scope.labelMoney*10000/$scope.firstMonths+$scope.labelMoney*10000*($scope.aboutList.min_rate/100))+$scope.labelMoney*10000/$scope.firstMonths*(1+($scope.aboutList.min_rate/100)))/2*$scope.firstMonths-$scope.labelMoney*10000).toFixed(1);//总利息
                    }
                    //先息后本还款法
                    $scope.allGross=($scope.labelMoney*10000*$scope.firstMonths*($scope.aboutList.min_rate/100)).toFixed(1);//总利息
                    $scope.monthlyInst=($scope.allGross/$scope.firstMonths).toFixed(1);//每个月还款额度(包含利息除去本金)
                }
                $scope.moneyClick();
            }
    });
    //金额
    $scope.labelChange=function(labelMoney){
        if(labelMoney==undefined){
            $scope.labelMoney="0";
            $scope.moneyClick();
        }else{
			labelMoney=labelMoney.replace(/[^\d.]/g,"");  //清除“数字”和“.”以外的字符     
			labelMoney=labelMoney.replace(/\.{2,}/g,"."); //只保留第一个. 清除多余的     
			labelMoney=labelMoney.replace(".","$#$").replace(/\./g,"").replace("$#$",".");    
			labelMoney=labelMoney.replace(/^(\-)*(\d+)\.(\d\d).*$/,'$1$2.$3');//只能输入两个小数     
			if(labelMoney.indexOf(".")< 0 && labelMoney !=""){//以上已经过滤，此处控制的是如果没有小数点，首位不能为类似于 01、02的金额    
			  $scope.labelMoney= parseFloat(labelMoney);	   
			}    
            $scope.moneyClick();
        }
    }
    //select
    $scope.change=function($index){
        if($index == undefined){
            return false;
        }
        $scope.firstMonths=$scope.monthsList[$index].number;//期限更换
        $scope.moneyClick();
    }
    //收藏
    var ensFalse=false;
    $scope.enShrine=function (ope) {
		if(GetQueryString("log")==0){
			window.location.href="https://m.baikejinrong.com/webapp/m/bk/#/landing?userid="+GetQueryString("userid")+"&code="+GetQueryString("code");
			return false;
		}
        //收藏url
        var enshrineUrl = $rootScope.URL_ROOTS + "/collection";
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
        if($scope.ensOne==true&&$scope.ensTwo==false){
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.enshrine));
            //加密结果
            $http({
                method:"POST",
                url:enshrineUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type': 'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //取消收藏
    $scope.inShrine=function (ype) {
        //取消收藏url
       var inshrineUrl = $rootScope.URL_ROOTS + "/collection/delete";
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
       if($scope.ensOne==false&&$scope.ensTwo==true){
            $http.get(inshrineUrl+"/"+$scope.enshrine.id+"/"+$scope.enshrine.type).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //封装传递给安卓和IOS
    $scope.loadURL = function (url) {
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    };
    //分享赚钱
    $scope.shareLoans=function () {
        var shareUrl=window.location.href;
        $scope.contentPamar={"title":"房抵押详情","content":"","Url":shareUrl};
        $scope.shareData=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://shareClick?"+$scope.shareData);
    }
    //用户点评
    $scope.userReviews=function ($trm) {
        window.location.href=$rootScope.ROOT+"review/review.html?p_id="+$trm.product_id+"&token="+$scope.sessionToken;
    }
    //立即申请
    $scope.applyOnce=function () {
		 if(GetQueryString("log")==0){
            window.location.href="https://m.baikejinrong.com/webapp/m/bk/#/landing?userid="+GetQueryString("userid")+"&code="+GetQueryString("code");
            return false;
        }
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
            var applyUrl=$rootScope.URL_ROOTS + "/apply/house";
            $scope.applyData={};
            $scope.applyData.product_id=$scope.aboutList.id;
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.applyData));
            //加密结果
            $http({
                method:"POST",
                url:applyUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type':'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
                    $scope.order_id=response.data.order_id;//订单id
					$scope.loadURL("BKDACTION://applyClick?"+$scope.order_id);
                    //window.location.href=$rootScope.ROOT+"review/process.html?order_id="+$scope.order_id+"&token="+$scope.sessionToken;
                }else if(response.status=="802"){
                    $scope.loadURL("BKDACTION://messageClick?"+response.message);
                }
            });
        }
    }
}]);
/**-银行贷详情-**/
app.controller('bankLoansController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>{{deatilsList.title}}</div>" +
        "<div class='details-share' ng-click='shareLoans();'><a>分享赚钱</a></div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //贷款详情url
    var bankUrl = $rootScope.URL_ROOTS + "/product/bank/"+GetQueryString("bank_id");
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    $scope.loading=true;
    $scope.ensOne=false;
    $scope.ensTwo=false;
    $http.get(bankUrl).success(
        function (response){
            if(response.status=="200"){
                $scope.loading=false;
                $('body').css("overflow", "auto");
                //贷款详情列表
                $scope.deatilsList=response.data;
                $scope.aboutList=response.data.product;
                if($scope.aboutList.is_collection==1){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                }else{
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                }
                //tab显示
                $scope.tabList=response.data.product.repayment_method;
                for(var i=0;i<$scope.tabList.length;i++){
                    var tabAll=[];
                    for(var j in $scope.tabList){
                        //tab的key
                        $scope.tabKey=(parseInt(j)+1).toString();
                        //tab的value
                        $scope.tabValue=$scope.tabList[j];
                        tabAll.push({
                            tabName:$scope.tabKey,
                            tabValue:$scope.tabValue
                        });
                    }
                }
                $scope.tabAll=tabAll;
                //选择框select
                $scope.selectList=response.data.product.stage;
                $scope.selectLen=$scope.selectList.split(',');
                var Months=[];
                for(var i=0;i<$scope.selectLen.length;i++){
                    $scope.lenStr=$scope.selectLen[i].replace("个月","");
                    Months.push({
                        days:$scope.selectLen[i],
                        number:$scope.lenStr,
                        numId:i
                    });
                }
                //期限列表
                $scope.monthsList=Months;
                //金额初始值
                $scope.labelMoney=($scope.aboutList.max_limit-$scope.aboutList.min_limit)/2+$scope.aboutList.min_limit;
                $scope.firstMonths=$scope.monthsList[0].number;//初始化月份
                $scope.moneyClick=function () {
                    //等额本息还款法
                    //每月月供额=〔贷款本金×月利率×(1＋月利率)＾还款月数〕÷〔(1＋月利率)＾还款月数-1〕
                    $scope.toMonthMoney=(($scope.labelMoney*10000*$scope.aboutList.min_rate/100*Math.pow((1+$scope.aboutList.min_rate/100),$scope.firstMonths))/(Math.pow((1+($scope.aboutList.min_rate/100)),$scope.firstMonths)-1)).toFixed(1);//每月月供额
                    $scope.instAll=($scope.firstMonths*$scope.toMonthMoney-$scope.labelMoney*10000).toFixed(1);//总利息
                    //等额本金还款法
                    var returnMoney="0";//已经归还的金额
                    for(var i=0;i<$scope.firstMonths;i++){
                        //第一个月月供额度
                        $scope.toMonthEqual=((($scope.labelMoney*10000)/$scope.firstMonths)+($scope.labelMoney*10000-returnMoney)*($scope.aboutList.min_rate/100)).toFixed(1)//每个月月供额度
                        returnMoney=+$scope.toMonthEqual;
                        $scope.decrease=($scope.labelMoney*10000/$scope.firstMonths)*($scope.aboutList.min_rate/100);//每个月递减多少
                        $scope.gross=((($scope.labelMoney*10000/$scope.firstMonths+$scope.labelMoney*10000*($scope.aboutList.min_rate/100))+$scope.labelMoney*10000/$scope.firstMonths*(1+($scope.aboutList.min_rate/100)))/2*$scope.firstMonths-$scope.labelMoney*10000).toFixed(1);//总利息
                    }
                    //先息后本还款法
                    $scope.allGross=($scope.labelMoney*10000*$scope.firstMonths*($scope.aboutList.min_rate/100)).toFixed(1);//总利息
                    $scope.monthlyInst=($scope.allGross/$scope.firstMonths).toFixed(1);//每个月还款额度(包含利息除去本金)
                }
                $scope.moneyClick();
            }
        });
    //金额
    $scope.labelChange=function(labelMoney){
        if(labelMoney==undefined){
            $scope.labelMoney="0";
            $scope.moneyClick();
        }else{
            labelMoney=labelMoney.replace(/[^\d.]/g,"");  //清除“数字”和“.”以外的字符     
			labelMoney=labelMoney.replace(/\.{2,}/g,"."); //只保留第一个. 清除多余的     
			labelMoney=labelMoney.replace(".","$#$").replace(/\./g,"").replace("$#$",".");    
			labelMoney=labelMoney.replace(/^(\-)*(\d+)\.(\d\d).*$/,'$1$2.$3');//只能输入两个小数     
			if(labelMoney.indexOf(".")< 0 && labelMoney !=""){//以上已经过滤，此处控制的是如果没有小数点，首位不能为类似于 01、02的金额    
			  $scope.labelMoney= parseFloat(labelMoney);	   
			}    
            $scope.moneyClick();
        }
    }
    //select
    $scope.change=function($index){
        if($index == undefined){
            return false;
        }
        $scope.firstMonths=$scope.monthsList[$index].number;//期限更换
        $scope.moneyClick();
    }
    //收藏
    var ensFalse=false;
    $scope.enShrine=function (ope) {
		 if(GetQueryString("log")==0){
            window.location.href="https://m.baikejinrong.com/webapp/m/bk/#/landing?userid="+GetQueryString("userid")+"&code="+GetQueryString("code");
            return false;
        }
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        //收藏url
        var enshrineUrl = $rootScope.URL_ROOTS + "/collection";
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
        if($scope.ensOne==true&&$scope.ensTwo==false){
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.enshrine));
            //加密结果
            $http({
                method:"POST",
                url:enshrineUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type': 'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //取消收藏
    $scope.inShrine=function (ype) {
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        //取消收藏url
        var inshrineUrl = $rootScope.URL_ROOTS + "/collection/delete";
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
        if($scope.ensOne==false&&$scope.ensTwo==true){
            $http.get(inshrineUrl+"/"+$scope.enshrine.id+"/"+$scope.enshrine.type).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //封装传递给安卓和IOS
    $scope.loadURL = function (url) {
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    };
    //分享赚钱
    $scope.shareLoans=function () {
        var shareUrl=window.location.href;
        $scope.contentPamar={"title":"信用贷详情","content":"","Url":shareUrl};
        $scope.shareData=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://shareClick?"+$scope.shareData);
    }
    //信用贷-立即申请
    $scope.oncePut=function () {
		 if(GetQueryString("log")==0){
            window.location.href="https://m.baikejinrong.com/webapp/m/bk/#/landing?userid="+GetQueryString("userid")+"&code="+GetQueryString("code");
            return false;
        }
        if(isEmpty($scope.sessionToken)){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
            //信用贷申请url
            var xinyongUrl = $rootScope.URL_ROOTS + "/apply/credit_loan";
            $scope.xinyong={};
            $scope.xinyong.product_id=GetQueryString("bank_id");
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.xinyong));
            //加密结果
            $http({
                method:"POST",
                url:xinyongUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type': 'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
					$scope.loadURL("BKDACTION://messageClick?"+response.message);
                    if(!isEmpty(response.data.product_url)){
                        window.location.href=response.data.product_url;
					}
                    /**
					else{
                        $scope.maskLayer=true;
                        $scope.modalBox=true;
                        $scope.modalMask=response.message;
                        $('body').css("overflow", "hidden");
                    }**/
                }else if(response.status=="802"){
					$scope.loadURL("BKDACTION://messageClick?"+response.message);
                    /**$scope.maskLayer=true;
                    $scope.modalBox=true;
                    $scope.modalMask=response.message;
                    $('body').css("overflow", "hidden");**/
                }
            });
        }
    }
    /**关闭弹窗**/
    $scope.layerClose=function () {
        $scope.maskLayer=false;
        $scope.modalBox=false;
        $('body').css("overflow", "auto");
    }
}]);
/**-极速贷详情-**/
app.controller('speedLoansController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>{{deatilsList.title}}</div>" +
        "<div class='details-share' ng-click='shareLoans();'><a>分享赚钱</a></div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".mort-cont").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".mort-cont").addClass("mrt-45");
    }
    //贷款详情url
    var speedUrl = $rootScope.URL_ROOTS + "/product/lightning/"+GetQueryString("speed_id");
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    $scope.loading=true;
    $scope.ensOne=false;
    $scope.ensTwo=false;
    $http.get(speedUrl).success(
        function (response){
            if(response.status=="200"){
                $scope.loading=false;
                $('body').css("overflow", "auto");
                //贷款详情列表
                $scope.deatilsList=response.data;
                $scope.aboutList=response.data.product;
                if($scope.aboutList.is_collection==1){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                }else{
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                }
                //tab显示
                $scope.tabList=response.data.product.repayment_method;
                for(var i=0;i<$scope.tabList.length;i++){
                    var tabAll=[];
                    for(var j in $scope.tabList){
                        //tab的key
                        $scope.tabKey=(parseInt(j)+1).toString();
                        //tab的value
                        $scope.tabValue=$scope.tabList[j];
                        tabAll.push({
                            tabName:$scope.tabKey,
                            tabValue:$scope.tabValue
                        });
                    }
                }
                $scope.tabAll=tabAll;
                //选择框select
                $scope.selectList=response.data.product.stage;
                $scope.selectLen=$scope.selectList.split(',');
                var Months=[];
                for(var i=0;i<$scope.selectLen.length;i++){
                    $scope.lenStr=$scope.selectLen[i].replace("个月","");
                    Months.push({
                        days:$scope.selectLen[i],
                        number:$scope.lenStr,
                        numId:i
                    });
                }
                //期限列表
                $scope.monthsList=Months;
                //金额初始值
                $scope.labelMoney=($scope.aboutList.max_limit-$scope.aboutList.min_limit)/2+$scope.aboutList.min_limit;
                $scope.firstMonths=$scope.monthsList[0].number;//初始化月份
                $scope.moneyClick=function () {
                    //等额本息还款法
                    //每月月供额=〔贷款本金×月利率×(1＋月利率)＾还款月数〕÷〔(1＋月利率)＾还款月数-1〕
                    $scope.toMonthMoney=(($scope.labelMoney*10000*$scope.aboutList.min_rate/100*Math.pow((1+$scope.aboutList.min_rate/100),$scope.firstMonths))/(Math.pow((1+($scope.aboutList.min_rate/100)),$scope.firstMonths)-1)).toFixed(1);//每月月供额
                    $scope.instAll=($scope.firstMonths*$scope.toMonthMoney-$scope.labelMoney*10000).toFixed(1);//总利息
                    //等额本金还款法
                    var returnMoney="0";//已经归还的金额
                    for(var i=0;i<$scope.firstMonths;i++){
                        //第一个月月供额度
                        $scope.toMonthEqual=((($scope.labelMoney*10000)/$scope.firstMonths)+($scope.labelMoney*10000-returnMoney)*($scope.aboutList.min_rate/100)).toFixed(1)//每个月月供额度
                        returnMoney=+$scope.toMonthEqual;
                        $scope.decrease=($scope.labelMoney*10000/$scope.firstMonths)*($scope.aboutList.min_rate/100);//每个月递减多少
                        $scope.gross=((($scope.labelMoney*10000/$scope.firstMonths+$scope.labelMoney*10000*($scope.aboutList.min_rate/100))+$scope.labelMoney*10000/$scope.firstMonths*(1+($scope.aboutList.min_rate/100)))/2*$scope.firstMonths-$scope.labelMoney*10000).toFixed(1);//总利息
                    }
                    //先息后本还款法
                    $scope.allGross=($scope.labelMoney*10000*$scope.firstMonths*($scope.aboutList.min_rate/100)).toFixed(1);//总利息
                    $scope.monthlyInst=($scope.allGross/$scope.firstMonths).toFixed(1);//每个月还款额度(包含利息除去本金)
                }
                $scope.moneyClick();
            }
        });
    //金额
    $scope.labelChange=function(labelMoney){
        if(labelMoney==undefined){
            $scope.labelMoney="0";
            $scope.moneyClick();
        }else{
            labelMoney=labelMoney.replace(/[^\d.]/g,"");  //清除“数字”和“.”以外的字符     
			labelMoney=labelMoney.replace(/\.{2,}/g,"."); //只保留第一个. 清除多余的     
			labelMoney=labelMoney.replace(".","$#$").replace(/\./g,"").replace("$#$",".");    
			labelMoney=labelMoney.replace(/^(\-)*(\d+)\.(\d\d).*$/,'$1$2.$3');//只能输入两个小数     
			if(labelMoney.indexOf(".")< 0 && labelMoney !=""){//以上已经过滤，此处控制的是如果没有小数点，首位不能为类似于 01、02的金额    
			  $scope.labelMoney= parseFloat(labelMoney);	   
			}    
            $scope.moneyClick();
        }
    }
    //select
    $scope.change=function($index){
        if($index == undefined){
            return false;
        }
        $scope.firstMonths=$scope.monthsList[$index].number;//期限更换
        $scope.moneyClick();
    }
    //收藏
    var ensFalse=false;
    $scope.enShrine=function (ope) {
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        //收藏url
        var enshrineUrl = $rootScope.URL_ROOTS + "/collection";
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
        if($scope.ensOne==true&&$scope.ensTwo==false){
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.enshrine));
            //加密结果
            $http({
                method:"POST",
                url:enshrineUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type': 'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //取消收藏
    $scope.inShrine=function (ype) {
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else{
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
        }
        //取消收藏url
        var inshrineUrl = $rootScope.URL_ROOTS + "/collection/delete";
        $scope.enshrine={};
        $scope.enshrine.id=$scope.aboutList.id;
        $scope.enshrine.type="1";
        if($scope.ensOne==false&&$scope.ensTwo==true){
            $http.get(inshrineUrl+"/"+$scope.enshrine.id+"/"+$scope.enshrine.type).success(function (response) {
                if(response.status=="200"){
                    $scope.ensOne=true;
                    $scope.ensTwo=false;
                    ensFalse=true;
                }else{
                    $scope.ensOne=false;
                    $scope.ensTwo=true;
                    ensFalse=false;
                }
            });
        }
    }
    //封装传递给安卓和IOS
    $scope.loadURL = function (url) {
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    };
    //分享赚钱
    $scope.shareLoans=function () {
        var shareUrl=window.location.href;
        $scope.contentPamar={"title":"极速贷详情","content":"","Url":shareUrl};
        $scope.shareData=JSON.stringify($scope.contentPamar);
        $scope.loadURL("BKDACTION://shareClick?"+$scope.shareData);
    }
    //极速贷-立即申请
    $scope.oncePut=function () {
        if(isEmpty(GetQueryString("token"))){
            $scope.loadURL("BKDACTION://loginClick?");
        }else {
            $scope.sessionToken = GetQueryString("token");
            sessionStorage.setItem("session", $scope.sessionToken);
            //极速贷申请url
            var jisuUrl = $rootScope.URL_ROOTS + "/apply/credit_loan";
            $scope.jisu={};
            $scope.jisu.product_id=GetQueryString("speed_id");
            //RSA加密
            $rootScope.encrypt=encrypt;
            var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
            encrypt.setPublicKey(public_key);
            $scope.enPram = encrypt.encrypt(JSON.stringify($scope.jisu));
            //加密结果
            $http({
                method:"POST",
                url:jisuUrl,
                data:{
                    parmater:$scope.enPram
                },
                headers:{
                    'Content-Type': 'application/x-www-form-urlencoded',
                    'Content-Type':'application/x-www-form-urlencoded;charset=UTF-8'
                },
            }).success(function (response) {
                if(response.status=="200"){
                    if(!isEmpty(response.data.product_url)){
                        window.location.href=response.data.product_url;
                    }else{
                        $scope.maskLayer=true;
                        $scope.modalBox=true;
                        $scope.modalMask="申请完成";
                        $('body').css("overflow", "hidden");
                    }
                }else if(response.status=="802"){
                    $scope.maskLayer=true;
                    $scope.modalBox=true;
                    $scope.modalMask=response.message;
                    $('body').css("overflow", "hidden");
                }else{
                    $scope.maskLayer=true;
                    $scope.modalBox=true;
                    $scope.modalMask=response.message;
                    $('body').css("overflow", "hidden");
                }
            });
        }
    }
    /**关闭弹窗**/
    $scope.layerClose=function () {
        $scope.maskLayer=false;
        $scope.modalBox=false;
        $('body').css("overflow", "auto");
    }
}]);
/**-房产估值-**/
app.controller('estimationController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>房产估值1</div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
        $(".estimation-review").removeClass("mrt-45");
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
        $(".estimation-review").addClass("mrt-45");
    }
    $scope.room={};
    $scope.areaStreet=true;//默认显示选择区域街道
    $scope.areaShow=false;//默认街道栏目隐藏
    $scope.estimateShow=true;//默认房产评估内容显示
    $scope.reference=false;//评估价格
    $scope.villageEst=false;//小区名称异常提示
    $scope.villTrue=false;//小区名称提示（自定义）
    $scope.timateHome=false;
    /**小区名称**/
    $scope.villageName=function ($rom) {
        var villageUrl=$rootScope.URL_ROOTS + "/product/villages";//小区接口URL
        var rmNum=/^[\u4E00-\u9FA5A-Za-z0-9]+$/;
        if(!rmNum.exec($rom.areas_name)){
            $scope.villageEst=true;
            $scope.villageError="请检查楼盘名称格式是否正确";
            return  false;
        }else{
            $scope.villageEst=false;
            $scope.villageError="";
            $http.get(villageUrl+'?name='+$rom.areas_name).success(function (response) {
                if(response.status=="200"){
                    if(response.data.length!="0"){
                        $scope.villTrue=true;
                        $scope.villageList=response.data;
                    }
                }
            });
        }
    }
    //选择小区返回给的小区列表
    $scope.villageClick=function ($ix) {
        $scope.reference=true;
        $scope.room.areas_name=$scope.villageList[$ix].areas_name;//小区名称
        if(!isEmpty($scope.room.areas_name)){
            $scope.timateHome=false;
        }
        $scope.areas_id=$scope.villageList[$ix].id;//小区名称
        $scope.address=$scope.villageList[$ix].address;//小区位置
        $scope.room.price=$scope.villageList[$ix].price;//参考均价
        $scope.streetid=$scope.villageList[$ix].streetid;//区域id
        if(isEmpty($scope.villageList[$ix].street)){
            $scope.areaStreet=true;
            $scope.room.street="请选择区域街道";
        }else{
            $scope.room.street=$scope.villageList[$ix].street;//区域街道
            if($scope.villageList[$ix].age=="0"){
                $scope.room.age="0";
            }else{
                var myDate= new Date();
                $scope.room.age=myDate.getFullYear()-$scope.villageList[$ix].age;//区域街道
                if($scope.room.age<0){
                    $scope.room.age="0";
                }
            }
            $scope.areaStreet=true;
        }
        $scope.villTrue=false;
    }
    $scope.room.street="请选择区域街道";
    /**请选择区域与街道**/
    $scope.location=function () {
        var estimationUrl=$rootScope.URL_ROOTS + "/product/areas";
        $http.get(estimationUrl).success(function (response) {
            $scope.loading=true;
            if(response.status=="200"){
                $scope.loading=false;
                $scope.estimateShow=false;
                $scope.areaShow=true;
                $(".area_box").fadeIn(1000);
                $scope.estimList=response.data;//列表区域内容
            }
        });
    }
    $scope.selectIndex=function ($index) {
        $scope.streets=$scope.estimList[$index].area;//街道数组
        $scope.reginStreet=$scope.estimList[$index].street_list;//区域
        var $this=$(".coord"+$index);
        var $that=$("#street"+$index);
        for(var i=0;i<$scope.estimList.length;i++){
            if($index==i){
                $this.show();
                $that.show();
            }else{
                $("#street"+i).hide();
            }
        }
        if ($this.find(".ara_div").children(".are-btn").hasClass("pysIcon")) {
            return false;
        } else {
            $this.find(".ara_div").children(".are-btn").addClass("pysIcon");
            $this.siblings().find(".are-btn").removeClass("pysIcon");
        }
    }
    $scope.selectStreet=function ($ins) {
        var $trn=$(".street_li"+$ins);
        if ($trn.find(".str_div").children(".are-btn").hasClass("pysIcon")) {
            return false;
        } else {
            $trn.find(".str_div").children(".are-btn").addClass("pysIcon");
            $trn.siblings().find(".are-btn").removeClass("pysIcon");
        }
        //街道名称
        $scope.streetNames=$scope.reginStreet[$ins].street;
        //街道名称ID
        $scope.streetId=$scope.reginStreet[$ins].id;
        if(!isEmpty($scope.streetId)){
            $scope.areaShow=false;
            $(".area_box").slideUp();
            $(".area_box").fadeOut(1000);
            $scope.room.street=$scope.streets+$scope.streetNames;//区域+街道
            $scope.address=$scope.streets+"-"+$scope.streetNames;
            $scope.room.price=$scope.reginStreet[$ins].price;
            $scope.room.streetid=$scope.reginStreet[$ins].id;//街道id
            $scope.estimateShow=true;
            $scope.reference=true;
        }
    }
   $(".est-text ul li .subject_label").click(function () {
        //选中单选框
        $(this).find($("input[type=radio]")).prop('checked', true);
        $(this).parents(".topic_radio").find(".radio_span").removeClass('radio_checked');
        $(this).children(".radio_span").addClass('radio_checked');
    });
    //初始化是否是全款房子+是否是企业法人或股东
    $scope.room.full_type="0";//默认是
    $scope.room.legal_type="0";//默认是
    //单选框
    var $thisHere = $(".est-text ul#full li .subject_label");
    var $thatHere = $(".est-text ul#legral li .subject_label");
    $("input[name='a1']")[0].checked=true;//初始化
    $("input[name='b1']")[0].checked=true;//初始化
    $scope.isFull=function () {
        //判断是否
        var $rItem = $("input[name='a1']");
        for(var j = 0;j < $rItem.length;j++){
            if($rItem[j].checked == true){
                if($rItem[0].checked==true){
                    $scope.room.full_type="0";//默认是
                }else{
                    $scope.room.full_type="1";//默认是
                }
            }
        }
    }
    $scope.noFull=function () {
        //判断是否
        var $aItem = $("input[name='b1']");
        for(var j = 0;j < $aItem.length;j++){
            if($aItem[j].checked == true){
                if($aItem[0].checked==true){
                    $scope.room.legal_type="0";//默认是
                }else{
                    $scope.room.legal_type="1";//默认是
                }
            }
        }
    }
    //封装传递给安卓和IOS
    $scope.loadURL = function (url) {
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    };
    //面积
    $scope.metre=function ($trs) {
        if(!isEmpty($trs.metre)){
            $scope.timateHome=false;
        }
    }
    //房龄
    $scope.estAge=function ($tm) {
        if(!isEmpty($tm.age)){
            $scope.timateHome=false;
        }
    }
    //计算
    $scope.timateClick=function () {
        if(isEmpty($scope.room.areas_name)){
            $scope.timateHome=true;
            $scope.timateShow="小区名称不能为空";
            return false;
        }
        if(isEmpty($scope.room.street)){
            $scope.timateHome=true;
            $scope.timateShow="位置区域不能为空";
            return false;
        }
        if(isEmpty($scope.room.metre)){
            $scope.timateHome=true;
            $scope.timateShow="面积不能为空";
            return false;
        }
        if(isEmpty($scope.room.age)){
            $scope.timateHome=true;
            $scope.timateShow="房龄不能为空";
            return false;
        }
        var countUrl=$rootScope.URL_ROOTS + "/product/calculator_loan_amount";
        $scope.loading=true;
        $http.get(countUrl+"?price="+$scope.room.price+"&acreage="+$scope.room.metre+"&type="+$scope.room.legal_type).success(function (response) {
            if(response.status=="200"){
                $scope.loading=false;
                $scope.total_price=response.data.total_price;//房产估值参数
                $scope.houseTtm={};//初始化
                $scope.houseTtm.total_price=$scope.total_price;//房产估值价格
                $scope.houseTtm.legal_type=$scope.room.legal_type;//是否企业法人
                $scope.houseTtm.age=$scope.room.age;//房龄
                $scope.contentPamar={"title":"房产评估","content":$scope.houseTtm};
                $scope.roomData=JSON.stringify($scope.contentPamar);
                $scope.loadURL("BKDACTION://contrastClick?"+$scope.roomData);
            }
        });
    }
}]);
/**-支付-**/
app.controller('payController',['$rootScope','$scope','$http',function ($rootScope,$scope,$http) {
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
    //支付定金接口
    var payUrl=$rootScope.URL_ROOTS + "/order/house_earnest/"+GetQueryString("pay_id");
    $scope.loading=true;
    $http.get(payUrl).success(function (response) {
        if(response.status=="200"){
            $scope.loading=false;
            $scope.payTitle=response.data.title;//支付定金标题
            $scope.payList=response.data.order_info;//支付定金数据
        }
    });
    //支付服务费接口
    var mentUrl=$rootScope.URL_ROOTS + "/order/house_evaluation/"+GetQueryString("pay_id");
    $scope.loading=true;
    $http.get(mentUrl).success(function (response) {
        if(response.status=="200"){
            $scope.loading=false;
            $scope.serviceTitle=response.data.title;//支付服务费标题
            $scope.serviceList=response.data.order_info;//支付服务费数据
            $scope.serviceAll=response.data.order_info.agency;//支付定金数据
        }
    });
	$scope.myDate= new Date();
	//支付-定金
    $scope.chooseDpay=function () {
        window.location.href=$rootScope.ROOT+"pay/chooseToPay.html?order_id="+$scope.payList.order_id+"&status="+$scope.payList.order_status+"&trade_type=earnest"+"&token="+$scope.sessionToken+"&date="+$scope.myDate;
    }
    //支付-服务费
    $scope.choosePay=function () {
        window.location.href=$rootScope.ROOT+"pay/chooseToPay.html?order_id="+$scope.serviceList.order_id+"&status="+$scope.payList.order_status+"&trade_type=assessment"+"&token="+$scope.sessionToken+"&date="+$scope.myDate;
    }
    //左侧撤回
    $scope.depositLeft=function () {
        window.location.href=$rootScope.ROOT+"review/process.html?order_id="+$scope.payList.order_id+"&bankType=0&historyBck=0"+"&token="+$scope.sessionToken;;
    }
}]);
/**-选择支付平台-**/
app.controller('choosePayController',['$rootScope','$scope','$http',function ($rootScope,$scope,$http) {
	//支付宝支付接口
    var zhifubaoUrl=$rootScope.URL_ROOTS + "/pay/alipay/";
	//微信支付接口
    var wepayUrl=$rootScope.URL_ROOTS + "/pay/wepay/";
    $scope.zhifubao={};
    $scope.zhifubao.o_id=GetQueryString("order_id");
	$scope.zhifubao.session=GetQueryString("token");
    $scope.zhifubao.status=GetQueryString("status");
    $scope.zhifubao.trade_type=GetQueryString("trade_type");
	$scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
	    $(".select-pay ul li .subject_pay").click(function () {
        //选中单选框
        $(this).find($("input[type=radio]")).prop('checked', true);
        $(this).parents(".topic_radio").find(".radio_pay").removeClass('radio_pay_checked');
        $(this).children(".radio_pay").addClass('radio_pay_checked');
    });
    $("input[name='a1']")[0].checked=true;//初始化
    var $itemVal = $("input[name='a1']").val();
	if($itemVal=="1"){
		//RSA加密
        $rootScope.encrypt=encrypt;
        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
        encrypt.setPublicKey(public_key);
        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.zhifubao));
        //更改订单状态-退款或者完成
		$scope.choosePay=function () {
			$http({
				method: "POST",
				url: wepayUrl,
				data: {
					parmater: $scope.enPram
                },
				headers: {
					'Content-Type': 'application/x-www-form-urlencoded',
					'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
					},
					}).success(function (response) {
						$(document.body).html(response);
						});
						}
	}
   //获取支付
    $scope.choosePy=function () {
        var payName = $(".select-pay .topic_radio li").length;
        //判断选择哪个
        for (var i = 1; i <= payName; i++) {
            var $em = $(".topic_radio input[name='a" + i + "']");
            var flag = false;
            for (var j = 0; j < $em.length; j++) {
                if ($em[j].checked == true) {
                    flag = true;
                    var $itemName = $em[j].name;
                    //被选的值
                    var $itemValue = $em[j].value;
                    var $itemVal = $(".topic_radio input[value='" + $itemValue + "']").val();
                    //console.log($itemVal);
                    if($itemValue=="1"){
						//RSA加密
                        $rootScope.encrypt=encrypt;
                        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
                        encrypt.setPublicKey(public_key);
                        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.zhifubao));
                        //更改订单状态-退款或者完成
                        $scope.choosePay=function () {
                            $http({
                                method: "POST",
                                url: wepayUrl,
                                data: {
                                    parmater: $scope.enPram
                                },
                                headers: {
                                    'Content-Type': 'application/x-www-form-urlencoded',
                                    'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
                                },
                            }).success(function (response) {
                                $(document.body).html(response);
                                // if(response.status=="200"){
                                //console.log(response);
                                // alert(response);
                                //}else{
                                //$scope.logMsg=response.message;
                                //  }
                            });
                        }
                    }else if($itemValue=="2"){

                    }else if($itemValue=="3"){
                        //RSA加密
                        $rootScope.encrypt=encrypt;
                        var public_key="-----BEGIN PUBLIC KEY-----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA59nmWjcxRXSzaTuCcSZPRjzdBESaYeaXZUNBNapiMo40/AIExg64pg1uLcHBDtLZBcCHecuZe43UpRpTje4GvldeP7GjhHkgEmWDKz3ic8QrMrRwpaIuLnS8EfWuir0J3WNtlbKsThJ5f7P6gRFYwLXYPuwJQQppSc12G3zFZZvURDIIHhWvEoSRdVM1oT9bQ66bPXRkDtNr4V915dyK3OS4Gn8k+NuJPfKlBaJ3wjxlchlYDsfck2sTkIBoAdGjASEFILtlcJfPwIM5mYG7Z98XVbX7e6261wbfCE9KSda+QNDPrWG3Xl7bdHflc9f4lAfWaD92XxCpGcCIrBtSDuZ8JUM20ubB6XUbpafO4oUfuX0ctrANsTG+NAbN3PgCL3xsbIRwKq1q/9YEYXJW3ojVQwj+fR8YzYEhK+F9IKRuGMuTM09RNqtF/Yb9gr97VK6yssS6MNFqGkyyqO2uIG3E9/CoTi6+NfE8rsAs+hvGLR1z4ZllqCqkKwBJrQ+U1xaOKCvA73Vuw8XSwfJ5176e34NdZlbs6AT0tkxcr/P79vma7HX5xrHrfL45mrWQ90KIMMNIpZob0+AqdzpO3Y6tCIoEjSD5+lJqWLacP6DAKq/VHfdGd9bIa7IJvVQyEkXV0SkYWgo+u2MzM1fcaD+1Hl7PRo5LtTZrnkVH/lcCAwEAAQ==-----END PUBLIC KEY-----";
                        encrypt.setPublicKey(public_key);
                        $scope.enPram = encrypt.encrypt(JSON.stringify($scope.zhifubao));
                        //更改订单状态-退款或者完成
                        $scope.choosePay=function () {
                            $http({
                                method: "POST",
                                url: zhifubaoUrl,
                                data: {
                                    parmater: $scope.enPram
                                },
                                headers: {
                                    'Content-Type': 'application/x-www-form-urlencoded',
                                    'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
                                },
                            }).success(function (response) {
                                $(document.body).html(response);
                                // if(response.status=="200"){
                                    //console.log(response);
                                   // alert(response);
                                //}else{
                                    //$scope.logMsg=response.message;
                              //  }
                            });
                        }
                    }
                    return false;
                }
            }
            if (!flag) {
                return;
            }
        }
    }
}]);
/**-实名认证-**/
app.controller('certificationController',['$rootScope','$scope','$http','$compile',function ($rootScope,$scope,$http,$compile) {
    var cHtml="<div class='mort-house-header'>"+
        "<div class='mort-margin'><div class='details-icon'><div class='mort-back-icon' back-home>"+
        "<img src='/webapp/m/hybrid/img/mortgage/back@0.png' width='100%' height='100%'/></div></div>"+
        "<div class='details-back-content'>实名认证</div></div></div>";
    var mobileDialogElement = $compile(angular.element(cHtml))($scope);
    if(GetQueryString("historyBck")==0){
        mobileDialogElement.remove();
    }else{
        angular.element("#cNodes").append(mobileDialogElement); //增加
    }
    var certUrl=$rootScope.URL_ROOTS + "/authentication/pay/bankback/";
    $scope.broker={};//初始化user
    $scope.bankError=false;
    $scope.brokerCheckBox="1";
    /*判断银行卡是否正确*/
    $scope.bankCheck=function(bankNumber){
        if(isEmpty(bankNumber.incard_num)){
            return false;
        }
        if (bankNumber.incard_num.length < 16 || bankNumber.incard_num.length > 19) {
            /*$scope.broker.error="银行卡号长度必须在16到19之间";*/
            return false;
        }
        var num = /^\d*$/;  //全数字
        if (!num.exec(bankNumber.incard_num)) {
            /*$scope.broker.error="银行卡号必须全为数字";*/
            return false;
        }
        //开头6位
        var strBin="10,18,30,35,37,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,58,60,62,65,68,69,84,87,88,94,95,98,99";
        if (strBin.indexOf(bankNumber.incard_num.substring(0, 2))== -1) {
            /* $scope.broker.error="银行卡号开头6位不符合规范";*/
            return false;
        }
        var lastNum=bankNumber.incard_num.substr(bankNumber.incard_num.length-1,1);//取出最后一位（与luhm进行比较）

        var first15Num=bankNumber.incard_num.substr(0,bankNumber.incard_num.length-1);//前15或18位
        var newArr=new Array();
        for(var i=first15Num.length-1;i>-1;i--){    //前15或18位倒序存进数组
            newArr.push(first15Num.substr(i,1));
        }
        var arrJiShu=new Array();  //奇数位*2的积 <9
        var arrJiShu2=new Array(); //奇数位*2的积 >9

        var arrOuShu=new Array();  //偶数位数组
        for(var j=0;j<newArr.length;j++){
            if((j+1)%2==1){//奇数位
                if(parseInt(newArr[j])*2<9)
                    arrJiShu.push(parseInt(newArr[j])*2);
                else
                    arrJiShu2.push(parseInt(newArr[j])*2);
            }
            else //偶数位
                arrOuShu.push(newArr[j]);
        }

        var jishu_child1=new Array();//奇数位*2 >9 的分割之后的数组个位数
        var jishu_child2=new Array();//奇数位*2 >9 的分割之后的数组十位数
        for(var h=0;h<arrJiShu2.length;h++){
            jishu_child1.push(parseInt(arrJiShu2[h])%10);
            jishu_child2.push(parseInt(arrJiShu2[h])/10);
        }

        var sumJiShu=0; //奇数位*2 < 9 的数组之和
        var sumOuShu=0; //偶数位数组之和
        var sumJiShuChild1=0; //奇数位*2 >9 的分割之后的数组个位数之和
        var sumJiShuChild2=0; //奇数位*2 >9 的分割之后的数组十位数之和
        var sumTotal=0;
        for(var m=0;m<arrJiShu.length;m++){
            sumJiShu=sumJiShu+parseInt(arrJiShu[m]);
        }

        for(var n=0;n<arrOuShu.length;n++){
            sumOuShu=sumOuShu+parseInt(arrOuShu[n]);
        }

        for(var p=0;p<jishu_child1.length;p++){
            sumJiShuChild1=sumJiShuChild1+parseInt(jishu_child1[p]);
            sumJiShuChild2=sumJiShuChild2+parseInt(jishu_child2[p]);
        }
        //计算总和
        sumTotal=parseInt(sumJiShu)+parseInt(sumOuShu)+parseInt(sumJiShuChild1)+parseInt(sumJiShuChild2);

        //计算Luhm值
        var k= parseInt(sumTotal)%10==0?10:parseInt(sumTotal)%10;
        var luhm= 10-k;

        if(lastNum==luhm){
            $scope.bankError="银行卡号验证通过";
            $scope.loading=true;
            $scope.sessionToken=GetQueryString("token");
            sessionStorage.setItem("session",$scope.sessionToken);
            $http.post(certUrl,$scope.broker).success(function(response) {
                $scope.loading = false;
                $scope.brokerNum=response.data;
                $scope.bankName=response.data.bankname;
            });
            return true;
        }
        else{
            $scope.bankError=true;
            $scope.bankError="银行卡错误，请检查银行卡号";
            return false;
        }
    }
    var regUrl=$rootScope.URL_ROOTS+"/authentication/pay/incardreg/";
    $(".check-text .radio_span0").click(function() {
        //checkbox
        if (!$(this).hasClass("radio_checked0")) {
            $(this).find($("input[type=checkbox]")).prop('checked',true);
        } else {
            $(this).find($("input[type=checkbox]")).prop('checked',false);
        }
        $(this).toggleClass('radio_checked0');
        if($("input[name='c1']").attr("checked")=='checked'){
            $scope.brokerCheckBox="0";
        }else{
            $scope.brokerCheckBox="1";
        }
    });
    /**判断持卡人是否填写**/
    $scope.banUerError=false;
    $scope.checkUser=function (baUser) {
        var userNum = /^[A-z]+$|^[\u4E00-\u9FA5]+$/;  //英文或者汉字
        if (!userNum.exec(baUser.family_name)) {
            $scope.banUerError=true;
            $scope.bUerError="持卡人必须为英文或者汉字";
            return false;
        }else{
            $scope.banUerError=false;
            $scope.bUerError="可以使用";
        }
    }
    /**判断手机号是否正确**/
    $scope.phoneError=false;
    $scope.checkPhone=function (ckPhone) {
        if(checkIsMobile(ckPhone.mobile)){
            $scope.phoneError=false;
            $scope.phoneError="手机号码格式正确";
            return  false;
        }else{
            $scope.phoneError=true;
            $scope.phoneError="请检查手机号是否正确";
        }
    }
    /**验证身份证号码**/
    $scope.isCardError=false;
    $scope.checkIsCard=function (isCard) {
        var reg = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/;
        if(reg.test(isCard.id_card) !== false){
            $scope.isCardError=false;
            $scope.isCardError="身份证号格式正确";
            return  false;
        }else{
            $scope.isCardError=true;
            $scope.isCardError="请检查身份证号是否正确";
        }
    }
    /**函数**/
    $scope.loadURL=function(url){
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    }
    /**提交并判断是否内容填写完整**/
    $scope.submitReg=function(){
        if($scope.brokerCheckBox=="1"){
            return false;
        }
        if($scope.bUerError=="可以使用"&&$scope.bankError=="银行卡号验证通过"&&$scope.phoneError=="手机号码格式正确"&&$scope.isCardError=="身份证号格式正确"&&$scope.brokerCheckBox=="0") {
            $scope.broker.inbank_code= $scope.brokerNum.bankcode;
            $scope.broker.inbank_name= $scope.brokerNum.bankname;
            $scope.broker.inbank_city= $scope.brokerNum.card_city;
            $scope.broker.card_name= $scope.brokerNum.card_name;
            $scope.broker.inbank_province= $scope.brokerNum.card_province;
            $scope.broker.inbank_type= $scope.brokerNum.card_type;
            $scope.loading=true;
            $http.post(regUrl,$scope.broker).success(function(response) {
                $scope.loading = false;
                if(response.status=="200"){
					if(isEmpty(GetQueryString("accountid"))){
                        $scope.loadURL("BKDACTION://certClick");
                    }
                    if(GetQueryString("accountid")==1){
                        $scope.loadURL("BKDACTION://certClick");
                    }else if(GetQueryString("accountid")==0){
                        $scope.loadURL("BKDACTION://uploadClick");
                    }
                    //$location.url("/credentials?token="+$scope.broker.session);
                    //return false;
                }
            });
        }else{
            /******/
        }
    }
}]);
/**-我的团队-**/
app.controller('groupController',['$rootScope','$scope','$http',function ($rootScope,$scope,$http) {
    var groupUrl = $rootScope.URL_ROOTS + "/myteam/commission";//我的团队提成
    $scope.sessionToken=GetQueryString("token");
    sessionStorage.setItem("session",$scope.sessionToken);
	/**函数**/
    $scope.loadURL=function(url){
        var iFrame;
        iFrame = document.createElement("iframe");
        iFrame.setAttribute("src", url);
        iFrame.setAttribute("style", "display:none;");
        iFrame.setAttribute("height", "0px");
        iFrame.setAttribute("width", "0px");
        iFrame.setAttribute("frameborder", "0");
        document.body.appendChild(iFrame);
        // 发起请求后这个iFrame就没用了，所以把它从dom上移除掉
        iFrame.parentNode.removeChild(iFrame);
        iFrame = null;
    }
    $http.get(groupUrl).success(function (response) {
        if (response.status == "200") {
            $scope.loading = false;
            $scope.teamssion=response.data[0];//团队提成
        }
    });
    var incomeUrl = $rootScope.URL_ROOTS + "/myteam/income";//我的收支明细
    $http.get(incomeUrl).success(function (response) {
        if (response.status == "200") {
            $scope.loading = false;
            console.log(response);
            $scope.incomeList=response.data;//明细
        }
    });
    var customerUrl = $rootScope.URL_ROOTS + "/myteam/customer";//我的客户
    $http.get(customerUrl).success(function (response) {
        if (response.status == "200") {
            $scope.loading = false;
            $scope.dataCustomer=response.data.data_customer;//客户
            $scope.dataTeam=response.data.data_team;//二级团队
        }
    });
    //邀请好友
    $scope.inviteFriends=function () {
        $scope.loadURL("BKDACTION://inviteFriendsClick?");
    }
}]);
//数字变化
app.directive("incrementNumber",[function(){
    return {
        restrict: "A",
        scope:{
            incnum: "&"
        },
        link:function(scope,element,attrs){
            var totalNumber = scope.incnum;
            scope.$watch(totalNumber,function(newVal,oldVal){
                if(newVal != undefined){
                    //原来几位数
                    var diaNum = 0;
                    var numAry = newVal.toString().split('.');
                    if(numAry.length > 1){
                        diaNum = numAry[1].length;
                    }
                    //间隔数
                    var intervalNum = parseFloat((newVal/5).toFixed(diaNum));
                    //自增数
                    var incNumber = 0;
                    function show(){
                        if(incNumber >= newVal){
                            //取消循环
                            clearInterval(intervalFuc);
                        }else{
                            incNumber = incNumber + intervalNum;
                            if(newVal-incNumber<10){
                                incNumber = newVal;
                            }
                            element.text(incNumber);
                        }
                    }
                    var intervalFuc=setInterval(show,100);
                }
            });
        }
    }
}]);
/**-返回上一层*指令-**/
app.directive('backHome', ['$window',function($window) {
    return {
        restrict: 'A',
        link: function (scope, elem, attrs) {
            elem.bind('click', function () {
                $window.history.back();//返回上一页
            });
        }
    };
}]);


